#!/usr/bin/env sh

set -e

MAMA_VERSION="$(cat "ВЕРСІЯ")"

if ! [ -d ".будування-вебсайту" ]; then
  mkdir ".будування-вебсайту"
fi
if ! [ -d ".будування-вебсайту/.вебсайт" ]; then
  cd ".будування-вебсайту"
  git clone "https://github.com/mavka-ukr/website" ".вебсайт" --depth=1
  cd -
else
  cd ".будування-вебсайту/.вебсайт"
  git pull
  cd -
fi

rm -rf ".будування-вебсайту/збудоване"

докс перетворити --вхід=документація --вихід=".будування-вебсайту/збудоване/$MAMA_VERSION/документація" --вигляд=".будування-вебсайту/.вебсайт/тема" --ґтег=
#cp -a 404.html ".будування-вебсайту/збудоване"
докс карта --вхід=".будування-вебсайту/збудоване" --вихід=".будування-вебсайту/збудоване" --домен=машина.мавка.укр
find ".будування-вебсайту/збудоване" -type f -name "*.html" -exec sed -i "s/{{ВЕРСІЯ_МАМА}}/$MAMA_VERSION/g" {} \;