#include <arpa/inet.h>
#include <liburing.h>
#include <netinet/in.h>
#include <poll.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/socket.h>
#include <unistd.h>

#define п8 uint8_t
#define п16 uint16_t
#define п32 uint32_t
#define п64 uint64_t
#define ц8 int8_t
#define ц16 int16_t
#define ц32 int32_t
#define ц64 int64_t
#define д32 float
#define д64 double
#define логічне uint8_t
#define позитивне п64
#define ціле ц64
#define дійсне д64
#define ніщо void
#define невідома_адреса void*
#define невідома_памʼять void*
#define памʼять_п8 п8*
#define адреса_памʼять_п8 п8**
#define памʼять_памʼять_п8 п8**
#define адреса_позитивне позитивне*
typedef struct т8 {
  позитивне розмір;
  памʼять_п8 дані;
} т8;
typedef struct ю8 {
  позитивне розмір;
  памʼять_п8 дані;
} ю8;
#define памʼять_т8 т8*
#define памʼять_ю8 ю8*

// <Виділяч.ю8.в>

typedef struct Виділяч Виділяч;

typedef struct Виділяч {
  невідома_адреса користувацькі_дані;

  памʼять_п8 (*виділити_сиру_памʼять)(Виділяч* виділяч, позитивне розмір);

  памʼять_п8 (*перевиділити_сиру_памʼять)(Виділяч* виділяч,
                                          памʼять_п8 значення,
                                          позитивне новий_розмір);

  void (*звільнити_сиру_памʼять)(Виділяч* виділяч, памʼять_п8 значення);
} Виділяч;

памʼять_п8 системний_виділяч_виділити_сиру_памʼять(Виділяч* виділяч,
                                                   позитивне розмір) {
  return malloc(розмір);
}

памʼять_п8 системний_виділяч_перевиділити_сиру_памʼять(Виділяч* виділяч,
                                                       памʼять_п8 значення,
                                                       позитивне новий_розмір) {
  return realloc(значення, новий_розмір);
}

void системний_виділяч_звільнити_сиру_памʼять(Виділяч* виділяч,
                                              памʼять_п8 значення) {
  free(значення);
}

Виділяч системний_виділяч = {
    .користувацькі_дані = NULL,
    .виділити_сиру_памʼять = системний_виділяч_виділити_сиру_памʼять,
    .перевиділити_сиру_памʼять = системний_виділяч_перевиділити_сиру_памʼять,
    .звільнити_сиру_памʼять = системний_виділяч_звільнити_сиру_памʼять,
};

extern Виділяч* __біб__отримати_системний_виділяч() {
  return &системний_виділяч;
}

// </Виділяч.ю8.в>

// <Друк.ю8.в>

extern void __біб__вивести(т8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
}

extern void __біб__надрукувати(т8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
  char newline = 10;
  fwrite(&newline, 1, 1, stdout);
}

extern void __біб__вивести_ю8(ю8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
}

extern void __біб__вивести_байти(позитивне розмір, памʼять_п8 дані) {
  fwrite(дані, розмір, 1, stdout);
}

extern void __біб__надрукувати_ю8(ю8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
  char newline = 10;
  fwrite(&newline, 1, 1, stdout);
}

extern void __біб__перетворити_позитивне_на_ю8(Виділяч* виділяч,
                                               позитивне значення,
                                               ю8* вихід) {
  int length = snprintf(NULL, 0, "%ld", значення);
  if (length < 0) {
    return;
  }

  char* buffer = (char*)виділяч->виділити_сиру_памʼять(виділяч, length + 1);
  if (!buffer) {
    return;
  }

  snprintf(buffer, length + 1, "%ld", значення);

  ю8 результат = {.розмір = length, .дані = (памʼять_п8)buffer};

  *вихід = результат;
}

extern void __біб__вивести_позитивне(позитивне значення) {
  printf("%lu", значення);
  fflush(stdout);
}

extern void __біб__надрукувати_позитивне(позитивне значення) {
  printf("%lu\n", значення);
  fflush(stdout);
}

// </Друк.ю8.в>