#include "mavka/biblioteka.h"

р64 бібліотека_мавки_Е_р64() {
  return бібліотека_мавки_експонента_р64(1.0);
}

р64 бібліотека_мавки_ЛОГ10_р64() {
  return бібліотека_мавки_лог_р64(10.0);
}

р64 бібліотека_мавки_ЛОГ2_р64() {
  return бібліотека_мавки_лог_р64(2.0);
}

р64 бібліотека_мавки_ЛОГ2Е_р64() {
  return бібліотека_мавки_лог2_р64(бібліотека_мавки_експонента_р64(1.0));
}

р64 бібліотека_мавки_ЛОГ10Е_р64() {
  return бібліотека_мавки_лог10_р64(бібліотека_мавки_експонента_р64(1.0));
}

р64 бібліотека_мавки_ПІ_р64() {
  return бібліотека_мавки_арккосинус_р64(-1.0);
}

р64 бібліотека_мавки_КОРІНЬ1_2_р64() {
  return бібліотека_мавки_корінь2_р64(0.5);
}

р64 бібліотека_мавки_КОРІНЬ2_р64() {
  return бібліотека_мавки_корінь2_р64(2.0);
}