#include "mavka/biblioteka.h"

р64 бібліотека_мавки_Е_р64() {
  return 2.718281828459045;
}

р64 бібліотека_мавки_ЛОГ10_р64() {
  return 2.302585092994046;
}

р64 бібліотека_мавки_ЛОГ2_р64() {
  return 0.6931471805599453;
}

р64 бібліотека_мавки_ЛОГ2Е_р64() {
  return 1.4426950408889634;
}

р64 бібліотека_мавки_ЛОГ10Е_р64() {
  return 0.4342944819032518;
}

р64 бібліотека_мавки_ПІ_р64() {
  return 3.141592653589793;
}

р64 бібліотека_мавки_КОРІНЬ1_2_р64() {
  return 0.7071067811865476;
}

р64 бібліотека_мавки_КОРІНЬ2_р64() {
  return 1.4142135623730951;
}