#!/usr/bin/env sh
set -e
set -x

ціль out/тестування_машини/Машина.тест.ll скомпілювати тестування_машини/Машина.тест.ц
ціль out/КД/КД.ll скомпілювати КД/КД.ц
ціль out/перекладач/перекладач.ll скомпілювати перекладач/перекладач.ц
ціль out/розбирач/розбирач.ll скомпілювати розбирач/розбирач.ц
ціль out/Допоміжне.ll скомпілювати Допоміжне.ц
ціль out/Машина.ll скомпілювати Машина.ц
ціль out/Очищувач.ll скомпілювати Очищувач.ц
ціль out/Предмет.ll скомпілювати Предмет.ц
ціль out/ПредметБайтів.ll скомпілювати ПредметБайтів.ц
ціль out/ПредметДії.ll скомпілювати ПредметДії.ц
ціль out/ПредметКоду.ll скомпілювати ПредметКоду.ц
ціль out/ПредметЛогічного.ll скомпілювати ПредметЛогічного.ц
ціль out/ПредметМодуля.ll скомпілювати ПредметМодуля.ц
ціль out/ПредметРесурсу.ll скомпілювати ПредметРесурсу.ц
ціль out/ПредметСередовища.ll скомпілювати ПредметСередовища.ц
ціль out/ПредметСловника.ll скомпілювати ПредметСловника.ц
ціль out/ПредметСписку.ll скомпілювати ПредметСписку.ц
ціль out/ПредметСтруктури.ll скомпілювати ПредметСтруктури.ц
ціль out/ПредметТексту.ll скомпілювати ПредметТексту.ц
ціль out/ПредметЧисла.ll скомпілювати ПредметЧисла.ц
ціль out/ПредметЮнікоду.ll скомпілювати ПредметЮнікоду.ц
ціль out/ПредметТипу.ll скомпілювати ПредметТипу.ц
ціль out/ПредметПараметра.ll скомпілювати ПредметПараметра.ц
ціль out/СкладенийПредмет.ll скомпілювати СкладенийПредмет.ц

clang -g -o out/тестування_машини/Машина.тест \
  out/тестування_машини/Машина.тест.ll \
  out/КД/КД.ll \
  out/перекладач/перекладач.ll \
  out/розбирач/розбирач.ll \
  out/Допоміжне.ll \
  out/Машина.ll \
  out/Очищувач.ll \
  out/Предмет.ll \
  out/ПредметБайтів.ll \
  out/ПредметДії.ll \
  out/ПредметКоду.ll \
  out/ПредметЛогічного.ll \
  out/ПредметМодуля.ll \
  out/ПредметНазви.ll \
  out/ПредметРесурсу.ll \
  out/ПредметСередовища.ll \
  out/ПредметСловника.ll \
  out/ПредметСписку.ll \
  out/ПредметСтруктури.ll \
  out/ПредметТексту.ll \
  out/ПредметЧисла.ll \
  out/ПредметЮнікоду.ll \
  out/ПредметТипу.ll \
  out/ПредметПараметра.ll \
  out/СкладенийПредмет.ll \
  ext.c

valgrind ./out/тестування_машини/Машина.тест