#include <arpa/inet.h>
#include <libgen.h>
#include <liburing.h>
#include <memory.h>
#include <netinet/in.h>
#include <poll.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/socket.h>
#include <unistd.h>

#define п8 uint8_t
#define п16 uint16_t
#define п32 uint32_t
#define п64 uint64_t
#define ц8 int8_t
#define ц16 int16_t
#define ц32 int32_t
#define ц64 int64_t
#define д32 float
#define д64 double
#define логічне uint8_t
#define природне п64
#define ціле ц64
#define ніщо void
#define невідома_адреса void*
#define невідома_памʼять void*

typedef struct текст текст;
typedef struct ю8 ю8;
typedef struct Інформація Інформація;
typedef struct Шлях Шлях;
typedef struct Файл Файл;

struct текст {
  природне розмір;
  п8* дані;
};

struct ю8 {
  природне розмір;
  п8* дані;
};

struct Інформація {
  природне розмір;
  п8* дані;
  природне вмісткість;
};

struct Шлях {
  природне розмір;
  п8* дані;
  природне вмісткість;
};

struct Файл {
  ц32 дескриптор;
};

extern ціле __біб__перекодувати_текст_в_ю8(текст* значення, ю8* вихід);

// <Памʼять.в.ц>

extern п8* __біб__виділити_сиру_памʼять(природне розмір) {
  return malloc(розмір);
}

extern п8* __біб__перевиділити_сиру_памʼять(п8* значення,
                                            природне новий_розмір) {
  return realloc(значення, новий_розмір);
}

extern void __біб__звільнити_сиру_памʼять(п8* значення) {
  free(значення);
}

// </Памʼять.в.ц>

// <Друк.в.ц>

extern void __біб__вивести(текст значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
}

extern void __біб__надрукувати(текст значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
  char newline = 10;
  fwrite(&newline, 1, 1, stdout);
}

extern void __біб__вивести_ю8(ю8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
}

extern void __біб__вивести_байти(природне розмір, п8* дані) {
  fwrite(дані, розмір, 1, stdout);
}

extern void __біб__надрукувати_ю8(ю8 значення) {
  fwrite(значення.дані, значення.розмір, 1, stdout);
  char newline = 10;
  fwrite(&newline, 1, 1, stdout);
}

extern void __біб__перетворити_природне_на_ю8(природне значення, ю8* вихід) {
  int length = snprintf(NULL, 0, "%ld", значення);
  if (length < 0) {
    return;
  }

  char* buffer = (char*)malloc(length + 1);
  if (!buffer) {
    return;
  }

  snprintf(buffer, length + 1, "%ld", значення);

  ю8 результат = {.розмір = length, .дані = (п8*)buffer};

  *вихід = результат;
}

extern void __біб__вивести_природне(природне значення) {
  printf("%lu", значення);
  fflush(stdout);
}

extern void __біб__надрукувати_природне(природне значення) {
  printf("%lu\n", значення);
  fflush(stdout);
}

// </Друк.в.ц>

// <Інформація.в.ц>

// ...

// </Інформація.в.ц>

// <Шлях.в.ц>

extern ціле __біб__шлях_з_ю8(ю8* значення, Шлях* вихід) {
  Шлях шлях;
  шлях.розмір = значення->розмір;
  шлях.дані = (п8*)malloc(значення->розмір);
  шлях.вмісткість = значення->розмір;
  if (!шлях.дані) {
    return -1;
  }
  memcpy(шлях.дані, значення->дані, значення->розмір);
  *вихід = шлях;
  return 0;
}

extern ціле __біб__шлях_з_тексту(текст* значення, Шлях* вихід) {
  ю8 значення_ю8;
  ціле результат = __біб__перекодувати_текст_в_ю8(значення, &значення_ю8);
  if (результат != 0) {
    return результат;
  }
  Шлях шлях;
  шлях.розмір = значення_ю8.розмір;
  шлях.дані = значення_ю8.дані;
  шлях.вмісткість = значення_ю8.розмір;
  *вихід = шлях;
  return 0;
}

extern ціле __біб__знищити_шлях(Шлях* шлях) {
  free(шлях->дані);
  return 0;
}

extern ціле __біб__клонувати_шлях(Шлях* шлях, Шлях* вихід) {
  Шлях новий_шлях;
  новий_шлях.розмір = шлях->розмір;
  новий_шлях.дані = (п8*)malloc(шлях->розмір);
  новий_шлях.вмісткість = шлях->розмір;
  if (!новий_шлях.дані) {
    return -1;
  }
  memcpy(новий_шлях.дані, шлях->дані, шлях->розмір);
  *вихід = новий_шлях;
  return 0;
}

extern ціле __біб__вивести_шлях(Шлях* шлях) {
  fwrite(шлях->дані, шлях->розмір, 1, stdout);
  return 0;
}

extern ціле __біб__надрукувати_шлях(Шлях* шлях) {
  fwrite(шлях->дані, шлях->розмір, 1, stdout);
  char newline = 10;
  fwrite(&newline, 1, 1, stdout);
  return 0;
}

extern ціле __біб__доповнити_шлях_ю8(Шлях* шлях, ю8* доповнення) {
  природне новий_розмір = шлях->розмір + доповнення->розмір;
  п8* нові_дані = (п8*)realloc(шлях->дані, новий_розмір);
  if (!нові_дані) {
    return -1;
  }
  memcpy(нові_дані + шлях->розмір, доповнення->дані, доповнення->розмір);
  шлях->дані = нові_дані;
  шлях->розмір = новий_розмір;
  шлях->вмісткість = новий_розмір;
  return 0;
}

extern ціле __біб__доповнити_шлях_текстом(Шлях* шлях, текст* доповнення) {
  ю8 значення_ю8;
  ціле результат = __біб__перекодувати_текст_в_ю8(доповнення, &значення_ю8);
  if (результат != 0) {
    return результат;
  }

  результат = __біб__доповнити_шлях_ю8(шлях, &значення_ю8);

  free(значення_ю8.дані);

  return результат;
}

extern ціле __біб__отримати_абсолютний_шлях(Шлях* шлях, Шлях* вихід) {
  char* тимчасовий_буфер = (char*)malloc(шлях->розмір + 1);
  if (!тимчасовий_буфер) {
    return -1;
  }
  memcpy(тимчасовий_буфер, шлях->дані, шлях->розмір);
  тимчасовий_буфер[шлях->розмір] = '\0';

  char абсолютний_шлях_буфер[4096];
  char* результат_реалізації =
      realpath(тимчасовий_буфер, абсолютний_шлях_буфер);
  free(тимчасовий_буфер);
  if (!результат_реалізації) {
    return -1;
  }

  природне довжина = strlen(абсолютний_шлях_буфер);

  Шлях абсолютний_шлях;
  абсолютний_шлях.розмір = довжина;
  абсолютний_шлях.дані = (п8*)malloc(довжина);
  абсолютний_шлях.вмісткість = довжина;
  if (!абсолютний_шлях.дані) {
    return -1;
  }
  memcpy(абсолютний_шлях.дані, абсолютний_шлях_буфер, довжина);

  *вихід = абсолютний_шлях;

  return 0;
}

extern ціле __біб__отримати_зовнішній_шлях(Шлях* шлях, Шлях* вихід) {
  char* тимчасовий_буфер = (char*)malloc(шлях->розмір + 1);
  if (!тимчасовий_буфер) {
    return -1;
  }
  memcpy(тимчасовий_буфер, шлях->дані, шлях->розмір);
  тимчасовий_буфер[шлях->розмір] = '\0';

  char зовнішній_шлях_буфер[4096];
  char* результат_реалізації = dirname(тимчасовий_буфер);
  if (!результат_реалізації) {
    free(тимчасовий_буфер);
    return -1;
  }

  природне довжина = strlen(результат_реалізації);

  Шлях зовнішній_шлях;
  зовнішній_шлях.розмір = довжина;
  зовнішній_шлях.дані = (п8*)malloc(довжина);
  зовнішній_шлях.вмісткість = довжина;
  if (!зовнішній_шлях.дані) {
    free(тимчасовий_буфер);
    return -1;
  }
  memcpy(зовнішній_шлях.дані, результат_реалізації, довжина);

  free(тимчасовий_буфер);

  *вихід = зовнішній_шлях;

  return 0;
}

extern ціле __біб__перевірити_чи_шлях_існує(Шлях* шлях) {
  char* тимчасовий_буфер = (char*)malloc(шлях->розмір + 1);
  if (!тимчасовий_буфер) {
    return -1;
  }
  memcpy(тимчасовий_буфер, шлях->дані, шлях->розмір);
  тимчасовий_буфер[шлях->розмір] = '\0';

  ц32 результат_перевірки = access(тимчасовий_буфер, F_OK);
  free(тимчасовий_буфер);
  if (результат_перевірки == 0) {
    return 1;
  } else {
    return 0;
  }

  return 0;
}

// </Шлях.в.ц>

// <Файли.в.ц>

extern ціле __біб__відкрити_файл(Шлях* шлях,
                                 логічне створити_якщо_не_існує,
                                 Файл** вихід) {
  Файл* файл = (Файл*)malloc(sizeof(Файл));
  if (!файл) {
    return -1;
  }

  char* тимчасовий_буфер = (char*)malloc(шлях->розмір + 1);
  if (!тимчасовий_буфер) {
    free(файл);
    return -1;
  }
  memcpy(тимчасовий_буфер, шлях->дані, шлях->розмір);
  тимчасовий_буфер[шлях->розмір] = '\0';

  файл->дескриптор =
      open(тимчасовий_буфер, O_RDWR | (O_CREAT * створити_якщо_не_існує),
           S_IRUSR | S_IWUSR | S_IRGRP | S_IROTH);

  free(тимчасовий_буфер);

  if (файл->дескриптор < 0) {
    free(файл);
    return -1;
  }

  *вихід = файл;

  return 0;
}

extern ціле __біб__відкрити_файл_для_перезапису(Шлях* шлях,
                                                логічне створити_якщо_не_існує,
                                                Файл** вихід) {
  Файл* файл = (Файл*)malloc(sizeof(Файл));
  if (!файл) {
    return -1;
  }

  char* тимчасовий_буфер = (char*)malloc(шлях->розмір + 1);
  if (!тимчасовий_буфер) {
    free(файл);
    return -1;
  }
  memcpy(тимчасовий_буфер, шлях->дані, шлях->розмір);
  тимчасовий_буфер[шлях->розмір] = '\0';

  файл->дескриптор = open(
      тимчасовий_буфер, O_WRONLY | (O_CREAT * створити_якщо_не_існує) | O_TRUNC,
      S_IRUSR | S_IWUSR | S_IRGRP | S_IROTH);

  free(тимчасовий_буфер);

  if (файл->дескриптор < 0) {
    free(файл);
    return -1;
  }

  *вихід = файл;

  return 0;
}

extern ціле __біб__закрити_файл(Файл* файл) {
  if (close(файл->дескриптор) < 0) {
    return -1;
  }

  return 0;
}

extern ціле __біб__прочитати_файл_повністю(Файл* файл, Інформація* вихід) {
  off_t поточна_позиція = lseek(файл->дескриптор, 0, SEEK_CUR);
  if (поточна_позиція == (off_t)-1) {
    return -1;
  }

  off_t розмір_файлу = lseek(файл->дескриптор, 0, SEEK_END);
  if (розмір_файлу == (off_t)-1) {
    return -1;
  }

  if (lseek(файл->дескриптор, поточна_позиція, SEEK_SET) == (off_t)-1) {
    return -1;
  }

  Інформація інформація;
  інформація.розмір = розмір_файлу;
  інформація.дані = (п8*)malloc(розмір_файлу);
  інформація.вмісткість = розмір_файлу;
  if (!інформація.дані) {
    return -1;
  }

  ssize_t прочитано_байт =
      read(файл->дескриптор, інформація.дані, розмір_файлу);
  if (прочитано_байт < 0 || (прочитано_байт != розмір_файлу)) {
    free(інформація.дані);
    return -1;
  }

  *вихід = інформація;

  return 0;
}

extern ціле __біб__прочитати_частину_файлу(Файл* файл,
                                           природне початок,
                                           природне розмір,
                                           п8* дані) {
  if (lseek(файл->дескриптор, початок, SEEK_SET) == (off_t)-1) {
    return -1;
  }

  ssize_t прочитано_байт = read(файл->дескриптор, дані, розмір);
  if (прочитано_байт < 0) {
    return -1;
  }

  return 0;
}

extern ціле __біб__записати_файл(Файл* файл, природне розмір, п8* дані) {
  if (lseek(файл->дескриптор, 0, SEEK_SET) == (off_t)-1) {
    return -1;
  }

  ssize_t записано_байт = write(файл->дескриптор, дані, розмір);
  if (записано_байт < 0 || (записано_байт != розмір)) {
    return -1;
  }

  return 0;
}

// </Файли.в.ц>

// <Процес.в.ц>

extern ціле __біб__отримати_робочу_директорію_процесу(Шлях* вихід) {
  п8 буфер[4096];
  п8* результат = (п8*)getcwd((char*)буфер, sizeof(буфер));
  if (!результат) {
    return -1;
  }

  природне довжина = strlen((char*)буфер);

  Шлях шлях;
  шлях.розмір = довжина;
  шлях.дані = (п8*)malloc(довжина);
  шлях.вмісткість = довжина;
  if (!шлях.дані) {
    return -1;
  }
  memcpy(шлях.дані, буфер, довжина);

  *вихід = шлях;

  return 0;
}

// </Процес.в.ц>
