#!/bin/bash
set -x
set -e

mkdir -p будування/напівготове/мавка
mkdir -p будування/готове

ціль будування/напівготове/мавка/Дійсність.ц.ллвмір перетворити мавка/Дійсність.ц
ціль будування/напівготове/мавка/ІменованоЗадіяні.ц.ллвмір перетворити мавка/ІменованоЗадіяні.ц
ціль будування/напівготове/мавка/КД.ц.ллвмір перетворити мавка/КД.ц
ціль будування/напівготове/мавка/Машина.ц.ллвмір перетворити мавка/Машина.ц
ціль будування/напівготове/мавка/Перекладач.ц.ллвмір перетворити мавка/Перекладач.ц
ціль будування/напівготове/мавка/Послідовність.ц.ллвмір перетворити мавка/Послідовність.ц
ціль будування/напівготове/мавка/Предмет.ц.ллвмір перетворити мавка/Предмет.ц
ціль будування/напівготове/мавка/ПредметДаних.ц.ллвмір перетворити мавка/ПредметДаних.ц
ціль будування/напівготове/мавка/ПредметДіапазонуДробових.ц.ллвмір перетворити мавка/ПредметДіапазонуДробових.ц
ціль будування/напівготове/мавка/ПредметДіапазонуЦілих.ц.ллвмір перетворити мавка/ПредметДіапазонуЦілих.ц
ціль будування/напівготове/мавка/ПредметДії.ц.ллвмір перетворити мавка/ПредметДії.ц
ціль будування/напівготове/мавка/ПредметДробового.ц.ллвмір перетворити мавка/ПредметДробового.ц
ціль будування/напівготове/мавка/ПредметЗміннихДаних.ц.ллвмір перетворити мавка/ПредметЗміннихДаних.ц
ціль будування/напівготове/мавка/ПредметКоду.ц.ллвмір перетворити мавка/ПредметКоду.ц
ціль будування/напівготове/мавка/ПредметМодуля.ц.ллвмір перетворити мавка/ПредметМодуля.ц
ціль будування/напівготове/мавка/ПредметПараметра.ц.ллвмір перетворити мавка/ПредметПараметра.ц
ціль будування/напівготове/мавка/ПредметПереборуДіапазонуДробових.ц.ллвмір перетворити мавка/ПредметПереборуДіапазонуДробових.ц
ціль будування/напівготове/мавка/ПредметПереборуДіапазонуЦілих.ц.ллвмір перетворити мавка/ПредметПереборуДіапазонуЦілих.ц
ціль будування/напівготове/мавка/ПредметСловника.ц.ллвмір перетворити мавка/ПредметСловника.ц
ціль будування/напівготове/мавка/ПредметСписку.ц.ллвмір перетворити мавка/ПредметСписку.ц
ціль будування/напівготове/мавка/ПредметСтруктури.ц.ллвмір перетворити мавка/ПредметСтруктури.ц
ціль будування/напівготове/мавка/ПредметТексту.ц.ллвмір перетворити мавка/ПредметТексту.ц
ціль будування/напівготове/мавка/ПредметЦілого.ц.ллвмір перетворити мавка/ПредметЦілого.ц
ціль будування/напівготове/мавка/Розбирач.ц.ллвмір перетворити мавка/Розбирач.ц
ціль будування/напівготове/старт.ц.ллвмір перетворити старт.ц

clang -ggdb -o будування/готове/мавка mavka.c \
  -lm \
  -x ir будування/напівготове/мавка/Дійсність.ц.ллвмір \
        будування/напівготове/мавка/ІменованоЗадіяні.ц.ллвмір \
        будування/напівготове/мавка/КД.ц.ллвмір \
        будування/напівготове/мавка/Машина.ц.ллвмір \
        будування/напівготове/мавка/Перекладач.ц.ллвмір \
        будування/напівготове/мавка/Послідовність.ц.ллвмір \
        будування/напівготове/мавка/Предмет.ц.ллвмір \
        будування/напівготове/мавка/ПредметДаних.ц.ллвмір \
        будування/напівготове/мавка/ПредметДіапазонуДробових.ц.ллвмір \
        будування/напівготове/мавка/ПредметДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/мавка/ПредметДії.ц.ллвмір \
        будування/напівготове/мавка/ПредметДробового.ц.ллвмір \
        будування/напівготове/мавка/ПредметЗміннихДаних.ц.ллвмір \
        будування/напівготове/мавка/ПредметКоду.ц.ллвмір \
        будування/напівготове/мавка/ПредметМодуля.ц.ллвмір \
        будування/напівготове/мавка/ПредметПараметра.ц.ллвмір \
        будування/напівготове/мавка/ПредметПереборуДіапазонуДробових.ц.ллвмір \
        будування/напівготове/мавка/ПредметПереборуДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/мавка/ПредметСловника.ц.ллвмір \
        будування/напівготове/мавка/ПредметСписку.ц.ллвмір \
        будування/напівготове/мавка/ПредметСтруктури.ц.ллвмір \
        будування/напівготове/мавка/ПредметТексту.ц.ллвмір \
        будування/напівготове/мавка/ПредметЦілого.ц.ллвмір \
        будування/напівготове/мавка/Розбирач.ц.ллвмір \
        будування/напівготове/старт.ц.ллвмір