#!/bin/bash
set -x
set -e

mkdir -p будування/напівготове
mkdir -p будування/готове

ціль будування/напівготове/машина.ц.ллвмір перетворити машина.ц
ціль будування/напівготове/розбирач.ц.ллвмір перетворити розбирач.ц
ціль будування/напівготове/перекладач.ц.ллвмір перетворити перекладач.ц
ціль будування/напівготове/старт.ц.ллвмір перетворити старт.ц
ціль будування/напівготове/КД.ц.ллвмір перетворити КД.ц
clang -o будування/готове/мавка mavka.c \
  -x ir будування/напівготове/машина.ц.ллвмір \
        будування/напівготове/розбирач.ц.ллвмір \
        будування/напівготове/перекладач.ц.ллвмір \
        будування/напівготове/КД.ц.ллвмір \
        будування/напівготове/старт.ц.ллвмір