#!/bin/bash
set -x
set -e

mkdir -p будування/напівготове/машина
mkdir -p будування/напівготове/перекладач
mkdir -p будування/напівготове/розбирач
mkdir -p будування/напівготове/пристрій
mkdir -p будування/готове

ціль будування/напівготове/машина/ВзятіЗначення.ц.ллвмір перетворити машина/ВзятіЗначення.ц
ціль будування/напівготове/машина/Дійсність.ц.ллвмір перетворити машина/Дійсність.ц
ціль будування/напівготове/машина/Допоміжне.ц.ллвмір перетворити машина/Допоміжне.ц
ціль будування/напівготове/машина/Значення.ц.ллвмір перетворити машина/Значення.ц
ціль будування/напівготове/машина/ІменованоЗадіяні.ц.ллвмір перетворити машина/ІменованоЗадіяні.ц
ціль будування/напівготове/машина/ІнформаціяПадіння.ц.ллвмір перетворити машина/ІнформаціяПадіння.ц
ціль будування/напівготове/машина/КористувацькіДані.ц.ллвмір перетворити машина/КористувацькіДані.ц
ціль будування/напівготове/машина/Машина.ц.ллвмір перетворити машина/Машина.ц
ціль будування/напівготове/машина/МісцезнаходженняВказівок.ц.ллвмір перетворити машина/МісцезнаходженняВказівок.ц
ціль будування/напівготове/машина/НакопичувачТексту.ц.ллвмір перетворити машина/НакопичувачТексту.ц
ціль будування/напівготове/машина/Послідовність.ц.ллвмір перетворити машина/Послідовність.ц
ціль будування/напівготове/машина/ПредметДаних.ц.ллвмір перетворити машина/ПредметДаних.ц
ціль будування/напівготове/машина/ПредметДіапазонуДробових.ц.ллвмір перетворити машина/ПредметДіапазонуДробових.ц
ціль будування/напівготове/машина/ПредметДіапазонуЦілих.ц.ллвмір перетворити машина/ПредметДіапазонуЦілих.ц
ціль будування/напівготове/машина/ПредметДії.ц.ллвмір перетворити машина/ПредметДії.ц
ціль будування/напівготове/машина/ПредметДробового.ц.ллвмір перетворити машина/ПредметДробового.ц
ціль будування/напівготове/машина/ПредметЗміннихДаних.ц.ллвмір перетворити машина/ПредметЗміннихДаних.ц
ціль будування/напівготове/машина/ПредметКоду.ц.ллвмір перетворити машина/ПредметКоду.ц
ціль будування/напівготове/машина/ПредметМодуля.ц.ллвмір перетворити машина/ПредметМодуля.ц
ціль будування/напівготове/машина/ПредметПараметра.ц.ллвмір перетворити машина/ПредметПараметра.ц
ціль будування/напівготове/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір перетворити машина/ПредметПереборуДіапазонуДробових.ц
ціль будування/напівготове/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір перетворити машина/ПредметПереборуДіапазонуЦілих.ц
ціль будування/напівготове/машина/ПредметПереборуСписку.ц.ллвмір перетворити машина/ПредметПереборуСписку.ц
ціль будування/напівготове/машина/ПредметСловника.ц.ллвмір перетворити машина/ПредметСловника.ц
ціль будування/напівготове/машина/ПредметСписку.ц.ллвмір перетворити машина/ПредметСписку.ц
ціль будування/напівготове/машина/ПредметСтруктури.ц.ллвмір перетворити машина/ПредметСтруктури.ц
ціль будування/напівготове/машина/ПредметТексту.ц.ллвмір перетворити машина/ПредметТексту.ц
ціль будування/напівготове/машина/ПредметЦілого.ц.ллвмір перетворити машина/ПредметЦілого.ц
ціль будування/напівготове/машина/Притримувач.ц.ллвмір перетворити машина/Притримувач.ц
ціль будування/напівготове/машина/Спроби.ц.ллвмір перетворити машина/Спроби.ц
ціль будування/напівготове/перекладач/перекладач.ц.ллвмір перетворити перекладач/перекладач.ц
ціль будування/напівготове/пристрій/глобальні.ц.ллвмір перетворити пристрій/глобальні.ц
ціль будування/напівготове/пристрій/пристрій.ц.ллвмір перетворити пристрій/пристрій.ц
ціль будування/напівготове/розбирач/розбирач.ц.ллвмір перетворити розбирач/розбирач.ц
ціль будування/напівготове/КД.ц.ллвмір перетворити КД.ц
ціль будування/напівготове/старт.ц.ллвмір перетворити старт.ц

clang -ggdb -lm -o будування/готове/мавка пристрій/prystriy.c start.c \
  -x ir будування/напівготове/машина/ВзятіЗначення.ц.ллвмір \
        будування/напівготове/машина/Дійсність.ц.ллвмір \
        будування/напівготове/машина/Допоміжне.ц.ллвмір \
        будування/напівготове/машина/Значення.ц.ллвмір \
        будування/напівготове/машина/ІменованоЗадіяні.ц.ллвмір \
        будування/напівготове/машина/ІнформаціяПадіння.ц.ллвмір \
        будування/напівготове/машина/КористувацькіДані.ц.ллвмір \
        будування/напівготове/машина/Машина.ц.ллвмір \
        будування/напівготове/машина/МісцезнаходженняВказівок.ц.ллвмір \
        будування/напівготове/машина/НакопичувачТексту.ц.ллвмір \
        будування/напівготове/машина/Послідовність.ц.ллвмір \
        будування/напівготове/машина/ПредметДаних.ц.ллвмір \
        будування/напівготове/машина/ПредметДіапазонуДробових.ц.ллвмір \
        будування/напівготове/машина/ПредметДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/машина/ПредметДії.ц.ллвмір \
        будування/напівготове/машина/ПредметДробового.ц.ллвмір \
        будування/напівготове/машина/ПредметЗміннихДаних.ц.ллвмір \
        будування/напівготове/машина/ПредметКоду.ц.ллвмір \
        будування/напівготове/машина/ПредметМодуля.ц.ллвмір \
        будування/напівготове/машина/ПредметПараметра.ц.ллвмір \
        будування/напівготове/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір \
        будування/напівготове/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/машина/ПредметПереборуСписку.ц.ллвмір \
        будування/напівготове/машина/ПредметСловника.ц.ллвмір \
        будування/напівготове/машина/ПредметСписку.ц.ллвмір \
        будування/напівготове/машина/ПредметСтруктури.ц.ллвмір \
        будування/напівготове/машина/ПредметТексту.ц.ллвмір \
        будування/напівготове/машина/ПредметЦілого.ц.ллвмір \
        будування/напівготове/машина/Притримувач.ц.ллвмір \
        будування/напівготове/машина/Спроби.ц.ллвмір \
        будування/напівготове/перекладач/перекладач.ц.ллвмір \
        будування/напівготове/пристрій/глобальні.ц.ллвмір \
        будування/напівготове/пристрій/пристрій.ц.ллвмір \
        будування/напівготове/розбирач/розбирач.ц.ллвмір \
        будування/напівготове/КД.ц.ллвмір \
        будування/напівготове/старт.ц.ллвмір