#!/bin/bash
set -x
set -e

BUILD_PLATFORM="$1"
TARGET_TRIPLE=""
TSIL_ARCH=""
TSIL_SYSTEM=""

if [ -z "$BUILD_PLATFORM" ]; then
  echo "Usage: $0 <x86_64-linux|aarch64-linux>"
  exit 1
fi

if [[ "$BUILD_PLATFORM" == "x86_64-linux" ]]; then
  TARGET_TRIPLE="x86_64-pc-linux-gnu"
  TSIL_ARCH="ікс86_64"
  TSIL_SYSTEM="лінукс"
elif [[ "$BUILD_PLATFORM" == "aarch64-linux" ]]; then
  TARGET_TRIPLE="aarch64-unknown-linux-gnu"
  TSIL_ARCH="аарч64"
  TSIL_SYSTEM="лінукс"
else
  echo "Unsupported build platform: $BUILD_PLATFORM"
  exit 1
fi

mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/бібліотека
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/КД
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/перекладач
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/пристрій
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/розбирач
mkdir -p будування/"$TSIL_ARCH-$TSIL_SYSTEM"/готове

ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/бібліотека/математика.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити бібліотека/математика.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/КД/КД.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити КД/КД.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ВзятіЗначення.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ВзятіЗначення.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Дійсність.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Дійсність.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Допоміжне.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Допоміжне.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Значення.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Значення.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ІменованоЗадіяні.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ІменованоЗадіяні.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ІнформаціяПадіння.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ІнформаціяПадіння.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/КористувацькіДані.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/КористувацькіДані.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Машина.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Машина.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/МісцезнаходженняВказівок.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/МісцезнаходженняВказівок.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/НакопичувачТексту.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/НакопичувачТексту.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Очищувач.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Очищувач.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Послідовність.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Послідовність.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДаних.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметДаних.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДіапазонуДробових.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметДіапазонуДробових.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДіапазонуЦілих.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметДіапазонуЦілих.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДії.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметДії.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДробового.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметДробового.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметЗміннихДаних.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметЗміннихДаних.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметКоду.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметКоду.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметМодуля.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметМодуля.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПараметра.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметПараметра.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметПереборуДіапазонуДробових.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметПереборуДіапазонуЦілих.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуСписку.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметПереборуСписку.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСловника.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметСловника.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСписку.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметСписку.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСтруктури.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметСтруктури.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметТексту.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметТексту.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметЦілого.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/ПредметЦілого.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Притримувач.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Притримувач.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Спроби.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити машина/Спроби.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/перекладач/перекладач.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити перекладач/перекладач.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/пристрій/глобальні.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити пристрій/глобальні.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/пристрій/пристрій.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити пристрій/пристрій.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/розбирач/розбирач.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити розбирач/розбирач.ц
ціль будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/старт.ц.ллвмір --архітектура="$TSIL_ARCH" --система="$TSIL_SYSTEM" перетворити старт.ц

clang -ggdb --target="$TARGET_TRIPLE" -lm -o будування/"$TSIL_ARCH-$TSIL_SYSTEM"/готове/мавка пристрій/prystriy.c start.c \
  -x ir будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/бібліотека/математика.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/КД/КД.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ВзятіЗначення.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Дійсність.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Допоміжне.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Значення.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ІменованоЗадіяні.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ІнформаціяПадіння.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/КористувацькіДані.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Машина.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/МісцезнаходженняВказівок.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/НакопичувачТексту.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Очищувач.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Послідовність.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДаних.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДіапазонуДробових.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДіапазонуЦілих.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДії.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметДробового.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметЗміннихДаних.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметКоду.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметМодуля.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПараметра.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметПереборуСписку.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСловника.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСписку.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметСтруктури.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметТексту.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/ПредметЦілого.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Притримувач.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/машина/Спроби.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/перекладач/перекладач.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/пристрій/глобальні.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/пристрій/пристрій.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/розбирач/розбирач.ц.ллвмір \
        будування/"$TSIL_ARCH-$TSIL_SYSTEM"/напівготове/старт.ц.ллвмір