#!/bin/bash
set -x
set -e

mkdir -p будування/напівготове/мавка/машина
mkdir -p будування/готове

ціль будування/напівготове/мавка/машина/Дійсність.ц.ллвмір перетворити мавка/машина/Дійсність.ц
ціль будування/напівготове/мавка/машина/Допоміжне.ц.ллвмір перетворити мавка/машина/Допоміжне.ц
ціль будування/напівготове/мавка/машина/Значення.ц.ллвмір перетворити мавка/машина/Значення.ц
ціль будування/напівготове/мавка/машина/ІменованоЗадіяні.ц.ллвмір перетворити мавка/машина/ІменованоЗадіяні.ц
ціль будування/напівготове/мавка/машина/ІнформаціяПадіння.ц.ллвмір перетворити мавка/машина/ІнформаціяПадіння.ц
ціль будування/напівготове/мавка/машина/Машина.ц.ллвмір перетворити мавка/машина/Машина.ц
ціль будування/напівготове/мавка/машина/МісцезнаходженняВказівок.ц.ллвмір перетворити мавка/машина/МісцезнаходженняВказівок.ц
ціль будування/напівготове/мавка/машина/НакопичувачТексту.ц.ллвмір перетворити мавка/машина/НакопичувачТексту.ц
ціль будування/напівготове/мавка/машина/Послідовність.ц.ллвмір перетворити мавка/машина/Послідовність.ц
ціль будування/напівготове/мавка/машина/ПредметДаних.ц.ллвмір перетворити мавка/машина/ПредметДаних.ц
ціль будування/напівготове/мавка/машина/ПредметДіапазонуДробових.ц.ллвмір перетворити мавка/машина/ПредметДіапазонуДробових.ц
ціль будування/напівготове/мавка/машина/ПредметДіапазонуЦілих.ц.ллвмір перетворити мавка/машина/ПредметДіапазонуЦілих.ц
ціль будування/напівготове/мавка/машина/ПредметДії.ц.ллвмір перетворити мавка/машина/ПредметДії.ц
ціль будування/напівготове/мавка/машина/ПредметДробового.ц.ллвмір перетворити мавка/машина/ПредметДробового.ц
ціль будування/напівготове/мавка/машина/ПредметЗміннихДаних.ц.ллвмір перетворити мавка/машина/ПредметЗміннихДаних.ц
ціль будування/напівготове/мавка/машина/ПредметКоду.ц.ллвмір перетворити мавка/машина/ПредметКоду.ц
ціль будування/напівготове/мавка/машина/ПредметМодуля.ц.ллвмір перетворити мавка/машина/ПредметМодуля.ц
ціль будування/напівготове/мавка/машина/ПредметПараметра.ц.ллвмір перетворити мавка/машина/ПредметПараметра.ц
ціль будування/напівготове/мавка/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір перетворити мавка/машина/ПредметПереборуДіапазонуДробових.ц
ціль будування/напівготове/мавка/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір перетворити мавка/машина/ПредметПереборуДіапазонуЦілих.ц
ціль будування/напівготове/мавка/машина/ПредметПереборуСписку.ц.ллвмір перетворити мавка/машина/ПредметПереборуСписку.ц
ціль будування/напівготове/мавка/машина/ПредметСловника.ц.ллвмір перетворити мавка/машина/ПредметСловника.ц
ціль будування/напівготове/мавка/машина/ПредметСписку.ц.ллвмір перетворити мавка/машина/ПредметСписку.ц
ціль будування/напівготове/мавка/машина/ПредметСтруктури.ц.ллвмір перетворити мавка/машина/ПредметСтруктури.ц
ціль будування/напівготове/мавка/машина/ПредметТексту.ц.ллвмір перетворити мавка/машина/ПредметТексту.ц
ціль будування/напівготове/мавка/машина/ПредметЦілого.ц.ллвмір перетворити мавка/машина/ПредметЦілого.ц
ціль будування/напівготове/мавка/глобальні.ц.ллвмір перетворити мавка/глобальні.ц
ціль будування/напівготове/мавка/перекладач.ц.ллвмір перетворити мавка/перекладач.ц
ціль будування/напівготове/мавка/розбирач.ц.ллвмір перетворити мавка/розбирач.ц
ціль будування/напівготове/КД.ц.ллвмір перетворити КД.ц
ціль будування/напівготове/старт.ц.ллвмір перетворити старт.ц

clang -ggdb -o будування/готове/мавка mavka.c \
  -lm \
  -x ir будування/напівготове/мавка/машина/Дійсність.ц.ллвмір \
        будування/напівготове/мавка/машина/Допоміжне.ц.ллвмір \
        будування/напівготове/мавка/машина/Значення.ц.ллвмір \
        будування/напівготове/мавка/машина/ІменованоЗадіяні.ц.ллвмір \
        будування/напівготове/мавка/машина/ІнформаціяПадіння.ц.ллвмір \
        будування/напівготове/мавка/машина/Машина.ц.ллвмір \
        будування/напівготове/мавка/машина/МісцезнаходженняВказівок.ц.ллвмір \
        будування/напівготове/мавка/машина/НакопичувачТексту.ц.ллвмір \
        будування/напівготове/мавка/машина/Послідовність.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметДаних.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметДіапазонуДробових.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметДії.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметДробового.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметЗміннихДаних.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметКоду.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметМодуля.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметПараметра.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметПереборуДіапазонуДробових.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметПереборуДіапазонуЦілих.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметПереборуСписку.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметСловника.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметСписку.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметСтруктури.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметТексту.ц.ллвмір \
        будування/напівготове/мавка/машина/ПредметЦілого.ц.ллвмір \
        будування/напівготове/мавка/глобальні.ц.ллвмір \
        будування/напівготове/мавка/перекладач.ц.ллвмір \
        будування/напівготове/мавка/розбирач.ц.ллвмір \
        будування/напівготове/КД.ц.ллвмір \
        будування/напівготове/старт.ц.ллвмір