#!/usr/bin/env sh
set -e
set -x

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"
#export CC="zig cc -target x86_64-windows"
#export CXX="zig c++ -target x86_64-windows"
#export AR="zig ar -target x86_64-windows"
#export RANLIB="zig ranlib -target-x86_64-windows"

mkdir -p build/external
cd build/external
cmake ../../external -G Ninja -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always
ninja
cd -

ціль .плавлення/мавка/компілятор.ll скомпілювати мавка/компілятор.ц
ціль .плавлення/мавка/мавка.ll скомпілювати мавка/мавка.ц
ціль .плавлення/МаМа/БазаНазв.ll скомпілювати МаМа/БазаНазв.ц
ціль .плавлення/МаМа/Код.ll скомпілювати МаМа/Код.ц
ціль .плавлення/МаМа/Машина.ll скомпілювати МаМа/Машина.ц
ціль .плавлення/МаМа/Обʼєкт.ll скомпілювати МаМа/Обʼєкт.ц
ціль .плавлення/МаМа/ОбʼєктДії.ll скомпілювати МаМа/ОбʼєктДії.ц
ціль .плавлення/МаМа/ОбʼєктМодуля.ll скомпілювати МаМа/ОбʼєктМодуля.ц
ціль .плавлення/МаМа/ОбʼєктНативноїДії.ll скомпілювати МаМа/ОбʼєктНативноїДії.ц
ціль .плавлення/МаМа/ОбʼєктСловника.ll скомпілювати МаМа/ОбʼєктСловника.ц
ціль .плавлення/МаМа/ОбʼєктСписку.ll скомпілювати МаМа/ОбʼєктСписку.ц
ціль .плавлення/МаМа/ОбʼєктСтруктури.ll скомпілювати МаМа/ОбʼєктСтруктури.ц
ціль .плавлення/МаМа/ОбʼєктТексту.ll скомпілювати МаМа/ОбʼєктТексту.ц
ціль .плавлення/МаМа/ОбʼєктЮнікоду.ll скомпілювати МаМа/ОбʼєктЮнікоду.ц
ціль .плавлення/МаМа/ОбʼєктЧисла.ll скомпілювати МаМа/ОбʼєктЧисла.ц
ціль .плавлення/МаМа/Помилка.ll скомпілювати МаМа/Помилка.ц
ціль .плавлення/МаМа/Середовище.ll скомпілювати МаМа/Середовище.ц
ціль .плавлення/МаМа/СкладенийОбʼєкт.ll скомпілювати МаМа/СкладенийОбʼєкт.ц
ціль .плавлення/МаМа/Утилізатор.ll скомпілювати МаМа/Утилізатор.ц
ціль .плавлення/старт.ll скомпілювати старт.ц
$CXX -o build/мавка \
  .плавлення/мавка/компілятор.ll \
  .плавлення/мавка/мавка.ll \
  .плавлення/МаМа/БазаНазв.ll \
  .плавлення/МаМа/Код.ll \
  .плавлення/МаМа/Машина.ll \
  .плавлення/МаМа/Обʼєкт.ll \
  .плавлення/МаМа/ОбʼєктДії.ll \
  .плавлення/МаМа/ОбʼєктМодуля.ll \
  .плавлення/МаМа/ОбʼєктНативноїДії.ll \
  .плавлення/МаМа/ОбʼєктСловника.ll \
  .плавлення/МаМа/ОбʼєктСписку.ll \
  .плавлення/МаМа/ОбʼєктСтруктури.ll \
  .плавлення/МаМа/ОбʼєктТексту.ll \
  .плавлення/МаМа/ОбʼєктЮнікоду.ll \
  .плавлення/МаМа/ОбʼєктЧисла.ll \
  .плавлення/МаМа/Помилка.ll \
  .плавлення/МаМа/Середовище.ll \
  .плавлення/МаМа/СкладенийОбʼєкт.ll \
  .плавлення/МаМа/Утилізатор.ll \
  .плавлення/старт.ll \
  build/external/libmavka_external.a \
  build/external/mavka_parser/libmavka_parser.a \
  build/external/mavka_parser/syntax/libmavka_syntax.a \
  build/external/mavka_parser/syntax/antlr4-cpp-runtime/libantlr4_cpp_runtime.a