#!/usr/bin/env sh
set -e
set -x

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"
#export CC="zig cc -target x86_64-windows"
#export CXX="zig c++ -target x86_64-windows"
#export AR="zig ar -target x86_64-windows"
#export RANLIB="zig ranlib -target-x86_64-windows"

mkdir -p build/external
cd build/external
cmake ../../external -G Ninja -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always
ninja
cd -

ціль .плавлення/мавка/компілятор.ll скомпілювати мавка/компілятор.ц
ціль .плавлення/мавка/мавка.ll скомпілювати мавка/мавка.ц

cd МаМа
ціль ../.плавлення/МаМа/КД/КД.ll скомпілювати КД/КД.ц
ціль ../.плавлення/МаМа/БазаНазв.ll скомпілювати БазаНазв.ц
ціль ../.плавлення/МаМа/Код.ll скомпілювати Код.ц
ціль ../.плавлення/МаМа/Машина.ll скомпілювати Машина.ц
ціль ../.плавлення/МаМа/Обʼєкт.ll скомпілювати Обʼєкт.ц
ціль ../.плавлення/МаМа/ОбʼєктДії.ll скомпілювати ОбʼєктДії.ц
ціль ../.плавлення/МаМа/ОбʼєктЛогічного.ll скомпілювати ОбʼєктЛогічного.ц
ціль ../.плавлення/МаМа/ОбʼєктМодуля.ll скомпілювати ОбʼєктМодуля.ц
ціль ../.плавлення/МаМа/ОбʼєктНативноїДії.ll скомпілювати ОбʼєктНативноїДії.ц
ціль ../.плавлення/МаМа/ОбʼєктСловника.ll скомпілювати ОбʼєктСловника.ц
ціль ../.плавлення/МаМа/ОбʼєктСписку.ll скомпілювати ОбʼєктСписку.ц
ціль ../.плавлення/МаМа/ОбʼєктСтруктури.ll скомпілювати ОбʼєктСтруктури.ц
ціль ../.плавлення/МаМа/ОбʼєктТексту.ll скомпілювати ОбʼєктТексту.ц
ціль ../.плавлення/МаМа/ОбʼєктЮнікоду.ll скомпілювати ОбʼєктЮнікоду.ц
ціль ../.плавлення/МаМа/ОбʼєктЧисла.ll скомпілювати ОбʼєктЧисла.ц
ціль ../.плавлення/МаМа/Помилка.ll скомпілювати Помилка.ц
ціль ../.плавлення/МаМа/Середовище.ll скомпілювати Середовище.ц
ціль ../.плавлення/МаМа/СкладенийОбʼєкт.ll скомпілювати СкладенийОбʼєкт.ц
ціль ../.плавлення/МаМа/Утилізатор.ll скомпілювати Утилізатор.ц
cd -
ціль .плавлення/старт.ll скомпілювати старт.ц

$CXX -o build/мавка \
  .плавлення/мавка/компілятор.ll \
  .плавлення/мавка/мавка.ll \
  .плавлення/МаМа/КД/КД.ll \
  .плавлення/МаМа/БазаНазв.ll \
  .плавлення/МаМа/Код.ll \
  .плавлення/МаМа/Машина.ll \
  .плавлення/МаМа/Обʼєкт.ll \
  .плавлення/МаМа/ОбʼєктДії.ll \
  .плавлення/МаМа/ОбʼєктЛогічного.ll \
  .плавлення/МаМа/ОбʼєктМодуля.ll \
  .плавлення/МаМа/ОбʼєктНативноїДії.ll \
  .плавлення/МаМа/ОбʼєктСловника.ll \
  .плавлення/МаМа/ОбʼєктСписку.ll \
  .плавлення/МаМа/ОбʼєктСтруктури.ll \
  .плавлення/МаМа/ОбʼєктТексту.ll \
  .плавлення/МаМа/ОбʼєктЮнікоду.ll \
  .плавлення/МаМа/ОбʼєктЧисла.ll \
  .плавлення/МаМа/Помилка.ll \
  .плавлення/МаМа/Середовище.ll \
  .плавлення/МаМа/СкладенийОбʼєкт.ll \
  .плавлення/МаМа/Утилізатор.ll \
  .плавлення/старт.ll \
  build/external/libmavka_external.a \
  build/external/mavka_parser/libmavka_parser.a \
  build/external/mavka_parser/syntax/libmavka_syntax.a \
  build/external/mavka_parser/syntax/antlr4-cpp-runtime/libantlr4_cpp_runtime.a