extern "C" {
#define АСДВидНіщо 0
#define АСДВидВизначити 1
#define АСДВидЗвернутись 2
#define АСДВидОтримати 3
#define АСДВидОтриматиЗаПозицією 5
#define АСДВидЗмінити 6
#define АСДВидЗмінитиЗаПозицією 8
#define АСДВидВиконати 9
#define АСДВидДія 12
#define АСДВидСтруктура 13
#define АСДВидЧисло 18
#define АСДВидТекст 19
#define АСДВидОперація 21
#define АСДВидЯкщо 22
#define АСДВидПоки 23
#define АСДВидВернути 24
#define АСДВидЗначенняЯкщо 27
#define АСДВидЯк 28
#define АСДВидСамоОперація 29
#define АСДВидВзяти 33 // 33

#define АСДОпераціяМноження 1
#define АСДОпераціяДілення 2
#define АСДОпераціяМодуль 3
#define АСДОпераціяДодавання 4
#define АСДОпераціяВіднімання 5
#define АСДОпераціяЗсувВліво 6
#define АСДОпераціяЗсувВправо 7
#define АСДОпераціяЗсувВправоЗнаковий 8
#define АСДОпераціяМенше 9
#define АСДОпераціяБільше 10
#define АСДОпераціяМеншеРівне 11
#define АСДОпераціяБільшеРівне 12
#define АСДОпераціяРівне 13
#define АСДОпераціяНерівне 14
#define АСДОпераціяДІ 15
#define АСДОпераціяВАБО 16
#define АСДОпераціяДАБО 17
#define АСДОпераціяІ 18
#define АСДОпераціяАБО 19

#define АСДСамоОпераціяЛогічнеНі 1
#define АСДСамоОпераціяДвійковеНі 2
#define АСДСамоОпераціяПлюс 3
#define АСДСамоОпераціяМінус 4

#define АСДВидимістьЗовнішня 0
#define АСДВидимістьМісцева 1
#define АСДВидимістьВнутрішня 2

struct Місцезнаходження;
struct АСДЗначення;
struct СписокАСДЗначень;

struct Ідентифікатор;
struct Параметр;
struct Аргумент;

struct АСДДаніВизначити;
struct АСДДаніЗвернутись;
struct АСДДаніОтримати;
struct АСДДаніОтриматиЗаПозицією;
struct АСДДаніЗмінити;
struct АСДДаніЗмінитиЗаПозицією;
struct АСДДаніВиконати;
struct АСДДаніДія;
struct АСДДаніСтруктура;
struct АСДДаніЧисло;
struct АСДДаніТекст;
struct АСДДаніОперація;
struct АСДДаніЯк;
struct АСДДаніЯкщо;
struct АСДДаніПоки;
struct АСДДаніВернути;
struct АСДДаніЗначенняЯкщо;
struct АСДДаніСамоОперація;
struct АСДДаніВзяти;

struct ТекстКоду;
struct ПомилкаРозборуМавки;
struct РезультатРозборуМавки;

struct Місцезнаходження {
  ТекстКоду* текст_коду;
  size_t рядок;
  size_t стовпець;
};

struct АСДЗначення {
  size_t вид;
  void* дані;
  Місцезнаходження* місцезнаходження;
};

struct СписокАСДЗначень {
  size_t довжина;
  АСДЗначення** елементи;
};

struct Ідентифікатор {
  char* значення;
  Місцезнаходження* місцезнаходження;
};

struct Параметр {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  Місцезнаходження* місцезнаходження;
};

struct Аргумент {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
  Місцезнаходження* місцезнаходження;
};

struct АСДДаніВизначити {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗвернутись {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтримати {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
};

struct АСДДаніЗмінити {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
  АСДЗначення* значення;
};

struct АСДДаніВиконати {
  АСДЗначення* обʼєкт;
  size_t кількість_аргументів;
  Аргумент** аргументи;
};

struct АСДДаніДія {
  size_t видимість;
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
  СписокАСДЗначень* тіло;
};

struct АСДДаніСтруктура {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* предок;
  size_t кількість_параметрів;
  Параметр** параметри;
};

struct АСДДаніЧисло {
  size_t база;
  char* значення;
  size_t дробове;
};

struct АСДДаніТекст {
  Ідентифікатор* ідентифікатор;
  char* значення;
};

struct АСДДаніОперація {
  АСДЗначення* ліво;
  size_t операція;
  АСДЗначення* право;
};

struct АСДДаніЯк {
  АСДЗначення* значення;
  АСДЗначення* тип;
};

struct АСДДаніЯкщо {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
  СписокАСДЗначень* тіло_інакше;
};

struct АСДДаніПоки {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
};

struct АСДДаніВернути {
  АСДЗначення* значення;
};

struct АСДДаніЗначенняЯкщо {
  АСДЗначення* умова;
  АСДЗначення* значення_так;
  АСДЗначення* значення_ні;
};

struct АСДДаніСамоОперація {
  size_t операція;
  АСДЗначення* обʼєкт;
};

struct АСДДаніВзяти {
  Ідентифікатор* тип;
  size_t довжина_шляху;
  Ідентифікатор** шлях;
};

struct ТекстКоду {
  char* шлях;
  char* значення;
};

struct ПомилкаРозборуМавки {
  Місцезнаходження* місцезнаходження;
  char* повідомлення;
};

struct РезультатРозборуМавки {
  size_t успіх;
  СписокАСДЗначень* тіло;
  ПомилкаРозборуМавки* помилка;
};

РезультатРозборуМавки* розібрати_мавку(ТекстКоду* текст_коду);
char* код_операції_в_юнікод(size_t операція);
}