#!/usr/bin/env bash

if [ -z "$1" ]; then
  echo "Не вказано шлях до Мавки"
  exit 1
fi

MAVKA=$(realpath $1)

cd тестування

TESTS=(
  "тести/_різне/0_визначено_все_що_треба.м" \
  "тести/Дія/0_дія_має_всі_властивості.м" \
  "тести/Дія/1_дія_виконується.м" \
  "тести/Дія/2_дія_перевіряє_типи_аргументів.м" \
  "тести/Структура/0_структура_має_всі_властивості.м" \
  "тести/число/0_число_має_всі_властивості.м" \
  "тести/текст/0_текст_має_всі_властивості.м" \
  "тести/текст/1_текст_отримання_елементів.м" \
  "тести/текст/2_текст_перевірка_на_місткість_елементів.м" \
  "тести/текст/3_текст_перебір.м" \
  "тести/текст/4_текст_додавання.м" \
  "тести/юнікод/0_юнікод_має_всі_властивості.м" \
  "тести/логічне/0_логічне_має_всі_властивості.м" \
  "тести/список/0_список_має_всі_властивості.м" \
  "тести/список/1_список_отримання_елементів.м" \
  "тести/список/2_список_зміна_елементів.м" \
  "тести/список/3_список_видалення_елементів.м" \
  "тести/список/4_список_перевірка_на_місткість_елементів.м" \
  "тести/список/5_список_перебір.м" \
  "тести/список/6_список_додати.м" \
  "тести/список/7_список_забрати.м" \
  "тести/список/8_список_фільтрувати.м" \
  "тести/список/9_список_знайти.м" \
  "тести/список/10_список_знайти_позицію.м" \
  "тести/список/11_список_перетворити.м" \
  "тести/список/12_список_обернути.м" \
  "тести/словник/0_словник_має_всі_властивості.м" \
  "тести/словник/1_словник_отримання_елементів.м" \
  "тести/словник/2_словник_зміна_елементів.м" \
  "тести/словник/3_словник_видалення_елементів.м" \
  "тести/словник/4_словник_перевірка_на_місткість_елементів.м" \
  "тести/словник/5_словник_отримання_ключів.м" \
  "тести/словник/6_словник_отримання_значень.м" \
  "тести/Модуль/0_модуль_працює.м"
)

for test in ${TESTS[@]}; do
  echo -en "$test"
  result=$($MAVKA "$test")
  if [ $? -ne 0 ]; then
    echo -en ":\n\e[31m$result\e[0m\n"
  elif [ "$result" == "" ]; then
    echo -en ": \e[32mпройдено\e[0m\n"
  else
    echo -en ":\n\e[31m$result\e[0m\n"
  fi
done

cd - >/dev/null