#!/usr/bin/env bash

if [ -z "$1" ]; then
  echo "Не вказано шлях до Мавки"
  exit 1
fi

MAVKA=$(realpath $1)

cd тестування

TESTS=(
  "тести/Дія/0_дія_має_всі_властивості.м" \
  "тести/Структура/0_структура_має_всі_властивості.м" \
  "тести/число/0_число_має_всі_властивості.м" \
  "тести/текст/0_текст_має_всі_властивості.м" \
  "тести/логічне/0_логічне_має_всі_властивості.м" \
  "тести/список/0_список_має_всі_властивості.м" \
  "тести/словник/0_словник_має_всі_властивості.м" \
  "тести/символ/0_символ_має_всі_властивості.м"
  "тести/Модуль/0_модуль_працює.м"
)

for test in ${TESTS[@]}; do
  echo -en "$test"
  result=$($MAVKA "$test")
  if [ $? -ne 0 ]; then
    echo -en ":\n\e[31m$result\e[0m\n"
  elif [ "$result" == "" ]; then
    echo -en ": \e[32mпройдено\e[0m\n"
  else
    echo -en ":\n\e[31m$result\e[0m\n"
  fi
done

cd - >/dev/null