#!/usr/bin/env sh
set -e
set -x

OUT="build-l/МаМа.a"

mkdir -p build-l

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"
export TSIL="ціль"

$TSIL .плавлення/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/КД/КД.o .плавлення/КД/КД.ll
$TSIL .плавлення/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/КД/КД.o .плавлення/КД/КД.ll
$TSIL .плавлення/допоміжне/біб.ll скомпілювати допоміжне/біб.ц
$CC -c -O3 -o .плавлення/допоміжне/біб.o .плавлення/допоміжне/біб.ll
$CC -c -O3 -o .плавлення/допоміжне/біб_c.o допоміжне/біб.c
$TSIL .плавлення/Код.ll скомпілювати Код.ц
$CC -c -O3 -o .плавлення/Код.o .плавлення/Код.ll
$TSIL .плавлення/Машина.ll скомпілювати Машина.ц
$CC -c -O3 -o .плавлення/Машина.o .плавлення/Машина.ll
$TSIL .плавлення/Назва.ll скомпілювати Назва.ц
$CC -c -O3 -o .плавлення/Назва.o .плавлення/Назва.ll
$TSIL .плавлення/Обʼєкт.ll скомпілювати Обʼєкт.ц
$CC -c -O3 -o .плавлення/Обʼєкт.o .плавлення/Обʼєкт.ll
$TSIL .плавлення/ОбʼєктБайтів.ll скомпілювати ОбʼєктБайтів.ц
$CC -c -O3 -o .плавлення/ОбʼєктБайтів.o .плавлення/ОбʼєктБайтів.ll
$TSIL .плавлення/ОбʼєктДії.ll скомпілювати ОбʼєктДії.ц
$CC -c -O3 -o .плавлення/ОбʼєктДії.o .плавлення/ОбʼєктДії.ll
$TSIL .плавлення/ОбʼєктЛогічного.ll скомпілювати ОбʼєктЛогічного.ц
$CC -c -O3 -o .плавлення/ОбʼєктЛогічного.o .плавлення/ОбʼєктЛогічного.ll
$TSIL .плавлення/ОбʼєктМодуля.ll скомпілювати ОбʼєктМодуля.ц
$CC -c -O3 -o .плавлення/ОбʼєктМодуля.o .плавлення/ОбʼєктМодуля.ll
$TSIL .плавлення/ОбʼєктНативноїДії.ll скомпілювати ОбʼєктНативноїДії.ц
$CC -c -O3 -o .плавлення/ОбʼєктНативноїДії.o .плавлення/ОбʼєктНативноїДії.ll
$TSIL .плавлення/ОбʼєктСловника.ll скомпілювати ОбʼєктСловника.ц
$CC -c -O3 -o .плавлення/ОбʼєктСловника.o .плавлення/ОбʼєктСловника.ll
$TSIL .плавлення/ОбʼєктСписку.ll скомпілювати ОбʼєктСписку.ц
$CC -c -O3 -o .плавлення/ОбʼєктСписку.o .плавлення/ОбʼєктСписку.ll
$TSIL .плавлення/ОбʼєктСтруктури.ll скомпілювати ОбʼєктСтруктури.ц
$CC -c -O3 -o .плавлення/ОбʼєктСтруктури.o .плавлення/ОбʼєктСтруктури.ll
$TSIL .плавлення/ОбʼєктТексту.ll скомпілювати ОбʼєктТексту.ц
$CC -c -O3 -o .плавлення/ОбʼєктТексту.o .плавлення/ОбʼєктТексту.ll
$TSIL .плавлення/ОбʼєктЮнікоду.ll скомпілювати ОбʼєктЮнікоду.ц
$CC -c -O3 -o .плавлення/ОбʼєктЮнікоду.o .плавлення/ОбʼєктЮнікоду.ll
$TSIL .плавлення/ОбʼєктЧисла.ll скомпілювати ОбʼєктЧисла.ц
$CC -c -O3 -o .плавлення/ОбʼєктЧисла.o .плавлення/ОбʼєктЧисла.ll
$TSIL .плавлення/Помилка.ll скомпілювати Помилка.ц
$CC -c -O3 -o .плавлення/Помилка.o .плавлення/Помилка.ll
$TSIL .плавлення/Середовище.ll скомпілювати Середовище.ц
$CC -c -O3 -o .плавлення/Середовище.o .плавлення/Середовище.ll
$TSIL .плавлення/СкладенийОбʼєкт.ll скомпілювати СкладенийОбʼєкт.ц
$CC -c -O3 -o .плавлення/СкладенийОбʼєкт.o .плавлення/СкладенийОбʼєкт.ll
$TSIL .плавлення/Утилізатор.ll скомпілювати Утилізатор.ц
$CC -c -O3 -o .плавлення/Утилізатор.o .плавлення/Утилізатор.ll

$AR rcs "$OUT" .плавлення/допоміжне/біб.o .плавлення/допоміжне/біб_c.o \
  .плавлення/КД/КД.o \
  .плавлення/Код.o \
  .плавлення/Машина.o \
  .плавлення/Назва.o \
  .плавлення/Обʼєкт.o \
  .плавлення/ОбʼєктБайтів.o \
  .плавлення/ОбʼєктДії.o \
  .плавлення/ОбʼєктЛогічного.o \
  .плавлення/ОбʼєктМодуля.o \
  .плавлення/ОбʼєктНативноїДії.o \
  .плавлення/ОбʼєктСловника.o \
  .плавлення/ОбʼєктСписку.o \
  .плавлення/ОбʼєктСтруктури.o \
  .плавлення/ОбʼєктТексту.o \
  .плавлення/ОбʼєктЮнікоду.o \
  .плавлення/ОбʼєктЧисла.o \
  .плавлення/Помилка.o \
  .плавлення/Середовище.o \
  .плавлення/СкладенийОбʼєкт.o \
  .плавлення/Утилізатор.o