#!/usr/bin/env sh
set -e
set -x

OUT="build-l/МаМа.a"

mkdir -p build-l

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"

ціль .плавлення/МаМа/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/МаМа/КД/КД.o .плавлення/МаМа/КД/КД.ll
ціль .плавлення/МаМа/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/МаМа/КД/КД.o .плавлення/МаМа/КД/КД.ll
ціль .плавлення/МаМа/Код.ll скомпілювати Код.ц
$CC -c -O3 -o .плавлення/МаМа/Код.o .плавлення/МаМа/Код.ll
ціль .плавлення/МаМа/Машина.ll скомпілювати Машина.ц
$CC -c -O3 -o .плавлення/МаМа/Машина.o .плавлення/МаМа/Машина.ll
ціль .плавлення/МаМа/Назва.ll скомпілювати Назва.ц
$CC -c -O3 -o .плавлення/МаМа/Назва.o .плавлення/МаМа/Назва.ll
ціль .плавлення/МаМа/Обʼєкт.ll скомпілювати Обʼєкт.ц
$CC -c -O3 -o .плавлення/МаМа/Обʼєкт.o .плавлення/МаМа/Обʼєкт.ll
ціль .плавлення/МаМа/ОбʼєктДії.ll скомпілювати ОбʼєктДії.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктДії.o .плавлення/МаМа/ОбʼєктДії.ll
ціль .плавлення/МаМа/ОбʼєктЛогічного.ll скомпілювати ОбʼєктЛогічного.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктЛогічного.o .плавлення/МаМа/ОбʼєктЛогічного.ll
ціль .плавлення/МаМа/ОбʼєктМодуля.ll скомпілювати ОбʼєктМодуля.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктМодуля.o .плавлення/МаМа/ОбʼєктМодуля.ll
ціль .плавлення/МаМа/ОбʼєктНативноїДії.ll скомпілювати ОбʼєктНативноїДії.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктНативноїДії.o .плавлення/МаМа/ОбʼєктНативноїДії.ll
ціль .плавлення/МаМа/ОбʼєктСловника.ll скомпілювати ОбʼєктСловника.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктСловника.o .плавлення/МаМа/ОбʼєктСловника.ll
ціль .плавлення/МаМа/ОбʼєктСписку.ll скомпілювати ОбʼєктСписку.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктСписку.o .плавлення/МаМа/ОбʼєктСписку.ll
ціль .плавлення/МаМа/ОбʼєктСтруктури.ll скомпілювати ОбʼєктСтруктури.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктСтруктури.o .плавлення/МаМа/ОбʼєктСтруктури.ll
ціль .плавлення/МаМа/ОбʼєктТексту.ll скомпілювати ОбʼєктТексту.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктТексту.o .плавлення/МаМа/ОбʼєктТексту.ll
ціль .плавлення/МаМа/ОбʼєктЮнікоду.ll скомпілювати ОбʼєктЮнікоду.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктЮнікоду.o .плавлення/МаМа/ОбʼєктЮнікоду.ll
ціль .плавлення/МаМа/ОбʼєктЧисла.ll скомпілювати ОбʼєктЧисла.ц
$CC -c -O3 -o .плавлення/МаМа/ОбʼєктЧисла.o .плавлення/МаМа/ОбʼєктЧисла.ll
ціль .плавлення/МаМа/Помилка.ll скомпілювати Помилка.ц
$CC -c -O3 -o .плавлення/МаМа/Помилка.o .плавлення/МаМа/Помилка.ll
ціль .плавлення/МаМа/Середовище.ll скомпілювати Середовище.ц
$CC -c -O3 -o .плавлення/МаМа/Середовище.o .плавлення/МаМа/Середовище.ll
ціль .плавлення/МаМа/СкладенийОбʼєкт.ll скомпілювати СкладенийОбʼєкт.ц
$CC -c -O3 -o .плавлення/МаМа/СкладенийОбʼєкт.o .плавлення/МаМа/СкладенийОбʼєкт.ll
ціль .плавлення/МаМа/Утилізатор.ll скомпілювати Утилізатор.ц
$CC -c -O3 -o .плавлення/МаМа/Утилізатор.o .плавлення/МаМа/Утилізатор.ll

$AR rcs "$OUT" .плавлення/МаМа/КД/КД.o \
  .плавлення/МаМа/Код.o \
  .плавлення/МаМа/Машина.o \
  .плавлення/МаМа/Назва.o \
  .плавлення/МаМа/Обʼєкт.o \
  .плавлення/МаМа/ОбʼєктДії.o \
  .плавлення/МаМа/ОбʼєктЛогічного.o \
  .плавлення/МаМа/ОбʼєктМодуля.o \
  .плавлення/МаМа/ОбʼєктНативноїДії.o \
  .плавлення/МаМа/ОбʼєктСловника.o \
  .плавлення/МаМа/ОбʼєктСписку.o \
  .плавлення/МаМа/ОбʼєктСтруктури.o \
  .плавлення/МаМа/ОбʼєктТексту.o \
  .плавлення/МаМа/ОбʼєктЮнікоду.o \
  .плавлення/МаМа/ОбʼєктЧисла.o \
  .плавлення/МаМа/Помилка.o \
  .плавлення/МаМа/Середовище.o \
  .плавлення/МаМа/СкладенийОбʼєкт.o \
  .плавлення/МаМа/Утилізатор.o