#!/usr/bin/env sh
set -e
set -x

OUT="build-l/МаМа.a"

mkdir -p build-l

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"

ціль .плавлення/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/КД/КД.o .плавлення/КД/КД.ll
ціль .плавлення/КД/КД.ll скомпілювати КД/КД.ц
$CC -c -O3 -o .плавлення/КД/КД.o .плавлення/КД/КД.ll
$CC -c -O3 -o .плавлення/допоміжне.o допоміжне/біб.c
ціль .плавлення/Код.ll скомпілювати Код.ц
$CC -c -O3 -o .плавлення/Код.o .плавлення/Код.ll
ціль .плавлення/Машина.ll скомпілювати Машина.ц
$CC -c -O3 -o .плавлення/Машина.o .плавлення/Машина.ll
ціль .плавлення/Назва.ll скомпілювати Назва.ц
$CC -c -O3 -o .плавлення/Назва.o .плавлення/Назва.ll
ціль .плавлення/Обʼєкт.ll скомпілювати Обʼєкт.ц
$CC -c -O3 -o .плавлення/Обʼєкт.o .плавлення/Обʼєкт.ll
ціль .плавлення/ОбʼєктДії.ll скомпілювати ОбʼєктДії.ц
$CC -c -O3 -o .плавлення/ОбʼєктДії.o .плавлення/ОбʼєктДії.ll
ціль .плавлення/ОбʼєктЛогічного.ll скомпілювати ОбʼєктЛогічного.ц
$CC -c -O3 -o .плавлення/ОбʼєктЛогічного.o .плавлення/ОбʼєктЛогічного.ll
ціль .плавлення/ОбʼєктМодуля.ll скомпілювати ОбʼєктМодуля.ц
$CC -c -O3 -o .плавлення/ОбʼєктМодуля.o .плавлення/ОбʼєктМодуля.ll
ціль .плавлення/ОбʼєктНативноїДії.ll скомпілювати ОбʼєктНативноїДії.ц
$CC -c -O3 -o .плавлення/ОбʼєктНативноїДії.o .плавлення/ОбʼєктНативноїДії.ll
ціль .плавлення/ОбʼєктСловника.ll скомпілювати ОбʼєктСловника.ц
$CC -c -O3 -o .плавлення/ОбʼєктСловника.o .плавлення/ОбʼєктСловника.ll
ціль .плавлення/ОбʼєктСписку.ll скомпілювати ОбʼєктСписку.ц
$CC -c -O3 -o .плавлення/ОбʼєктСписку.o .плавлення/ОбʼєктСписку.ll
ціль .плавлення/ОбʼєктСтруктури.ll скомпілювати ОбʼєктСтруктури.ц
$CC -c -O3 -o .плавлення/ОбʼєктСтруктури.o .плавлення/ОбʼєктСтруктури.ll
ціль .плавлення/ОбʼєктТексту.ll скомпілювати ОбʼєктТексту.ц
$CC -c -O3 -o .плавлення/ОбʼєктТексту.o .плавлення/ОбʼєктТексту.ll
ціль .плавлення/ОбʼєктЮнікоду.ll скомпілювати ОбʼєктЮнікоду.ц
$CC -c -O3 -o .плавлення/ОбʼєктЮнікоду.o .плавлення/ОбʼєктЮнікоду.ll
ціль .плавлення/ОбʼєктЧисла.ll скомпілювати ОбʼєктЧисла.ц
$CC -c -O3 -o .плавлення/ОбʼєктЧисла.o .плавлення/ОбʼєктЧисла.ll
ціль .плавлення/Помилка.ll скомпілювати Помилка.ц
$CC -c -O3 -o .плавлення/Помилка.o .плавлення/Помилка.ll
ціль .плавлення/Середовище.ll скомпілювати Середовище.ц
$CC -c -O3 -o .плавлення/Середовище.o .плавлення/Середовище.ll
ціль .плавлення/СкладенийОбʼєкт.ll скомпілювати СкладенийОбʼєкт.ц
$CC -c -O3 -o .плавлення/СкладенийОбʼєкт.o .плавлення/СкладенийОбʼєкт.ll
ціль .плавлення/Утилізатор.ll скомпілювати Утилізатор.ц
$CC -c -O3 -o .плавлення/Утилізатор.o .плавлення/Утилізатор.ll

$AR rcs "$OUT" .плавлення/допоміжне.o \
  .плавлення/КД/КД.o \
  .плавлення/Код.o \
  .плавлення/Машина.o \
  .плавлення/Назва.o \
  .плавлення/Обʼєкт.o \
  .плавлення/ОбʼєктДії.o \
  .плавлення/ОбʼєктЛогічного.o \
  .плавлення/ОбʼєктМодуля.o \
  .плавлення/ОбʼєктНативноїДії.o \
  .плавлення/ОбʼєктСловника.o \
  .плавлення/ОбʼєктСписку.o \
  .плавлення/ОбʼєктСтруктури.o \
  .плавлення/ОбʼєктТексту.o \
  .плавлення/ОбʼєктЮнікоду.o \
  .плавлення/ОбʼєктЧисла.o \
  .плавлення/Помилка.o \
  .плавлення/Середовище.o \
  .плавлення/СкладенийОбʼєкт.o \
  .плавлення/Утилізатор.o