#!/usr/bin/env bash
set -e
set -x

PLATFORM="w"

export CC="zig cc -target x86_64-windows"
export CXX="zig c++ -target x86_64-windows"
export AR="zig ar"
export RANLIB="zig ranlib"
export USE_JEMALLOC=no
export USE_SYSTEMD=no
export TSIL="ціль"
OUT="build-$PLATFORM/mavka"

READLINE_AVAILABLE=0

mkdir -p build-"$PLATFORM"/external
cd build-"$PLATFORM"/external
cmake ../../external -G Ninja -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always -DREADLINE_AVAILABLE="$READLINE_AVAILABLE"
ninja
cd -

$TSIL .плавлення/мавка/бібліотека/М.ll скомпілювати мавка/бібліотека/М.ц
$TSIL .плавлення/мавка/бібліотека/мавка.ll скомпілювати мавка/бібліотека/мавка.ц
$TSIL .плавлення/мавка/бібліотека/МаМа.ll скомпілювати мавка/бібліотека/МаМа.ц
$TSIL .плавлення/мавка/бібліотека/читати_юнікод.ll скомпілювати мавка/бібліотека/читати_юнікод.ц
$TSIL .плавлення/мавка/компілятор.ll скомпілювати мавка/компілятор.ц
$TSIL .плавлення/мавка/мавка.ll скомпілювати мавка/мавка.ц
$TSIL .плавлення/МаМа/КД/КД.ll скомпілювати МаМа/КД/КД.ц
$TSIL .плавлення/МаМа/біб.ll скомпілювати МаМа/біб.ц
$TSIL .плавлення/МаМа/Код.ll скомпілювати МаМа/Код.ц
$TSIL .плавлення/МаМа/Машина.ll скомпілювати МаМа/Машина.ц
$TSIL .плавлення/МаМа/Назва.ll скомпілювати МаМа/Назва.ц
$TSIL .плавлення/МаМа/Обʼєкт.ll скомпілювати МаМа/Обʼєкт.ц
$TSIL .плавлення/МаМа/ОбʼєктБайтів.ll скомпілювати МаМа/ОбʼєктБайтів.ц
$TSIL .плавлення/МаМа/ОбʼєктДії.ll скомпілювати МаМа/ОбʼєктДії.ц
$TSIL .плавлення/МаМа/ОбʼєктЛогічного.ll скомпілювати МаМа/ОбʼєктЛогічного.ц
$TSIL .плавлення/МаМа/ОбʼєктМодуля.ll скомпілювати МаМа/ОбʼєктМодуля.ц
$TSIL .плавлення/МаМа/ОбʼєктНативноїДії.ll скомпілювати МаМа/ОбʼєктНативноїДії.ц
$TSIL .плавлення/МаМа/ОбʼєктСловника.ll скомпілювати МаМа/ОбʼєктСловника.ц
$TSIL .плавлення/МаМа/ОбʼєктСписку.ll скомпілювати МаМа/ОбʼєктСписку.ц
$TSIL .плавлення/МаМа/ОбʼєктСтруктури.ll скомпілювати МаМа/ОбʼєктСтруктури.ц
$TSIL .плавлення/МаМа/ОбʼєктТексту.ll скомпілювати МаМа/ОбʼєктТексту.ц
$TSIL .плавлення/МаМа/ОбʼєктЮнікоду.ll скомпілювати МаМа/ОбʼєктЮнікоду.ц
$TSIL .плавлення/МаМа/ОбʼєктЧисла.ll скомпілювати МаМа/ОбʼєктЧисла.ц
$TSIL .плавлення/МаМа/Помилка.ll скомпілювати МаМа/Помилка.ц
$TSIL .плавлення/МаМа/Середовище.ll скомпілювати МаМа/Середовище.ц
$TSIL .плавлення/МаМа/СкладенийОбʼєкт.ll скомпілювати МаМа/СкладенийОбʼєкт.ц
$TSIL .плавлення/МаМа/Утилізатор.ll скомпілювати МаМа/Утилізатор.ц
$TSIL .плавлення/старт.ll скомпілювати старт.ц

CXX_OPTIONS=(
  "-O3"
)
if [ "$READLINE_AVAILABLE" -eq 1 ]; then
  CXX_OPTIONS+=("-lreadline")
fi


mkdir build/мавка/
mkdir build/мавка/бібліотека
mkdir build/МаМа/
mkdir build/МаМа/КД/
clang -c -o build/мавка/бібліотека/М.o .плавлення/мавка/бібліотека/М.ll
clang -c -o build/мавка/бібліотека/мавка.o .плавлення/мавка/бібліотека/мавка.ll
clang -c -o build/мавка/бібліотека/МаМа.o .плавлення/мавка/бібліотека/МаМа.ll
clang -c -o build/мавка/бібліотека/читати_юнікод.o .плавлення/мавка/бібліотека/читати_юнікод.ll
clang -c -o build/мавка/компілятор.o .плавлення/мавка/компілятор.ll
clang -c -o build/мавка/мавка.o .плавлення/мавка/мавка.ll
clang -c -o build/старт.o .плавлення/старт.ll
clang -c -o build/МаМа/КД/КД.o .плавлення/МаМа/КД/КД.ll
clang -c -o build/МаМа/біб.o .плавлення/МаМа/біб.ll
clang -c -o build/МаМа/Код.o .плавлення/МаМа/Код.ll
clang -c -o build/МаМа/Машина.o .плавлення/МаМа/Машина.ll
clang -c -o build/МаМа/Назва.o .плавлення/МаМа/Назва.ll
clang -c -o build/МаМа/Обʼєкт.o .плавлення/МаМа/Обʼєкт.ll
clang -c -o build/МаМа/ОбʼєктБайтів.o .плавлення/МаМа/ОбʼєктБайтів.ll
clang -c -o build/МаМа/ОбʼєктДії.o .плавлення/МаМа/ОбʼєктДії.ll
clang -c -o build/МаМа/ОбʼєктЛогічного.o .плавлення/МаМа/ОбʼєктЛогічного.ll
clang -c -o build/МаМа/ОбʼєктМодуля.o .плавлення/МаМа/ОбʼєктМодуля.ll
clang -c -o build/МаМа/ОбʼєктНативноїДії.o .плавлення/МаМа/ОбʼєктНативноїДії.ll
clang -c -o build/МаМа/ОбʼєктСловника.o .плавлення/МаМа/ОбʼєктСловника.ll
clang -c -o build/МаМа/ОбʼєктСписку.o .плавлення/МаМа/ОбʼєктСписку.ll
clang -c -o build/МаМа/ОбʼєктСтруктури.o .плавлення/МаМа/ОбʼєктСтруктури.ll
clang -c -o build/МаМа/ОбʼєктТексту.o .плавлення/МаМа/ОбʼєктТексту.ll
clang -c -o build/МаМа/ОбʼєктЮнікоду.o .плавлення/МаМа/ОбʼєктЮнікоду.ll
clang -c -o build/МаМа/ОбʼєктЧисла.o .плавлення/МаМа/ОбʼєктЧисла.ll
clang -c -o build/МаМа/Помилка.o .плавлення/МаМа/Помилка.ll
clang -c -o build/МаМа/Середовище.o .плавлення/МаМа/Середовище.ll
clang -c -o build/МаМа/СкладенийОбʼєкт.o .плавлення/МаМа/СкладенийОбʼєкт.ll
clang -c -o build/МаМа/Утилізатор.o .плавлення/МаМа/Утилізатор.ll

$CXX "${CXX_OPTIONS[@]}" -o "$OUT" \
  .плавлення/мавка/бібліотека/М.ll \
  .плавлення/мавка/бібліотека/мавка.ll \
  .плавлення/мавка/бібліотека/МаМа.ll \
  .плавлення/мавка/бібліотека/читати_юнікод.ll \
  .плавлення/мавка/компілятор.ll \
  .плавлення/мавка/мавка.ll \
  .плавлення/старт.ll \
  .плавлення/МаМа/КД/КД.ll \
  .плавлення/МаМа/біб.ll \
  .плавлення/МаМа/Код.ll \
  .плавлення/МаМа/Машина.ll \
  .плавлення/МаМа/Назва.ll \
  .плавлення/МаМа/Обʼєкт.ll \
  .плавлення/МаМа/ОбʼєктБайтів.ll \
  .плавлення/МаМа/ОбʼєктДії.ll \
  .плавлення/МаМа/ОбʼєктЛогічного.ll \
  .плавлення/МаМа/ОбʼєктМодуля.ll \
  .плавлення/МаМа/ОбʼєктНативноїДії.ll \
  .плавлення/МаМа/ОбʼєктСловника.ll \
  .плавлення/МаМа/ОбʼєктСписку.ll \
  .плавлення/МаМа/ОбʼєктСтруктури.ll \
  .плавлення/МаМа/ОбʼєктТексту.ll \
  .плавлення/МаМа/ОбʼєктЮнікоду.ll \
  .плавлення/МаМа/ОбʼєктЧисла.ll \
  .плавлення/МаМа/Помилка.ll \
  .плавлення/МаМа/Середовище.ll \
  .плавлення/МаМа/СкладенийОбʼєкт.ll \
  .плавлення/МаМа/Утилізатор.ll \
  build-"$PLATFORM"/external/libmavka_external.a \
  build-"$PLATFORM"/external/mavka_parser/libmavka_parser.a \
  build-"$PLATFORM"/external/mavka_parser/syntax/libmavka_syntax.a \
  build-"$PLATFORM"/external/mavka_parser/syntax/antlr4-cpp-runtime/libantlr4_cpp_runtime.a \
  external/main.cpp