#!/usr/bin/env bash
set -e
set -x

PLATFORM="l"

export CC="clang"
export CXX="clang++"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"
export TSIL="ціль"
OUT="build-$PLATFORM/мавка"

READLINE_AVAILABLE=0
if [ -f /usr/include/readline/readline.h ]; then
  READLINE_AVAILABLE=1
fi

mkdir -p build-"$PLATFORM"/external
cd build-"$PLATFORM"/external
cmake ../../external -G Ninja -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always -DREADLINE_AVAILABLE="$READLINE_AVAILABLE"
ninja
cd -

$TSIL .плавлення/мавка/бібліотека/М.ll скомпілювати мавка/бібліотека/М.ц
$TSIL .плавлення/мавка/бібліотека/мавка.ll скомпілювати мавка/бібліотека/мавка.ц
$TSIL .плавлення/мавка/бібліотека/МаМа.ll скомпілювати мавка/бібліотека/МаМа.ц
$TSIL .плавлення/мавка/бібліотека/читати_юнікод.ll скомпілювати мавка/бібліотека/читати_юнікод.ц
$TSIL .плавлення/мавка/компілятор.ll скомпілювати мавка/компілятор.ц
$TSIL .плавлення/мавка/мавка.ll скомпілювати мавка/мавка.ц
$TSIL .плавлення/МаМа/КД/КД.ll скомпілювати МаМа/КД/КД.ц
$TSIL .плавлення/МаМа/біб.ll скомпілювати МаМа/біб.ц
$TSIL .плавлення/МаМа/Код.ll скомпілювати МаМа/Код.ц
$TSIL .плавлення/МаМа/Машина.ll скомпілювати МаМа/Машина.ц
$TSIL .плавлення/МаМа/Назва.ll скомпілювати МаМа/Назва.ц
$TSIL .плавлення/МаМа/Обʼєкт.ll скомпілювати МаМа/Обʼєкт.ц
$TSIL .плавлення/МаМа/ОбʼєктБайтів.ll скомпілювати МаМа/ОбʼєктБайтів.ц
$TSIL .плавлення/МаМа/ОбʼєктДії.ll скомпілювати МаМа/ОбʼєктДії.ц
$TSIL .плавлення/МаМа/ОбʼєктЛогічного.ll скомпілювати МаМа/ОбʼєктЛогічного.ц
$TSIL .плавлення/МаМа/ОбʼєктМодуля.ll скомпілювати МаМа/ОбʼєктМодуля.ц
$TSIL .плавлення/МаМа/ОбʼєктНативноїДії.ll скомпілювати МаМа/ОбʼєктНативноїДії.ц
$TSIL .плавлення/МаМа/ОбʼєктСловника.ll скомпілювати МаМа/ОбʼєктСловника.ц
$TSIL .плавлення/МаМа/ОбʼєктСписку.ll скомпілювати МаМа/ОбʼєктСписку.ц
$TSIL .плавлення/МаМа/ОбʼєктСтруктури.ll скомпілювати МаМа/ОбʼєктСтруктури.ц
$TSIL .плавлення/МаМа/ОбʼєктТексту.ll скомпілювати МаМа/ОбʼєктТексту.ц
$TSIL .плавлення/МаМа/ОбʼєктЮнікоду.ll скомпілювати МаМа/ОбʼєктЮнікоду.ц
$TSIL .плавлення/МаМа/ОбʼєктЧисла.ll скомпілювати МаМа/ОбʼєктЧисла.ц
$TSIL .плавлення/МаМа/Помилка.ll скомпілювати МаМа/Помилка.ц
$TSIL .плавлення/МаМа/Середовище.ll скомпілювати МаМа/Середовище.ц
$TSIL .плавлення/МаМа/СкладенийОбʼєкт.ll скомпілювати МаМа/СкладенийОбʼєкт.ц
$TSIL .плавлення/МаМа/Утилізатор.ll скомпілювати МаМа/Утилізатор.ц
$TSIL .плавлення/старт.ll скомпілювати старт.ц

CXX_OPTIONS=(
  "-O3"
)
if [ "$READLINE_AVAILABLE" -eq 1 ]; then
  CXX_OPTIONS+=("-lreadline")
fi

$CXX "${CXX_OPTIONS[@]}" -o "$OUT" \
  .плавлення/мавка/бібліотека/М.ll \
  .плавлення/мавка/бібліотека/мавка.ll \
  .плавлення/мавка/бібліотека/МаМа.ll \
  .плавлення/мавка/бібліотека/читати_юнікод.ll \
  .плавлення/мавка/компілятор.ll \
  .плавлення/мавка/мавка.ll \
  .плавлення/старт.ll \
  .плавлення/МаМа/КД/КД.ll \
  .плавлення/МаМа/біб.ll \
  .плавлення/МаМа/Код.ll \
  .плавлення/МаМа/Машина.ll \
  .плавлення/МаМа/Назва.ll \
  .плавлення/МаМа/Обʼєкт.ll \
  .плавлення/МаМа/ОбʼєктБайтів.ll \
  .плавлення/МаМа/ОбʼєктДії.ll \
  .плавлення/МаМа/ОбʼєктЛогічного.ll \
  .плавлення/МаМа/ОбʼєктМодуля.ll \
  .плавлення/МаМа/ОбʼєктНативноїДії.ll \
  .плавлення/МаМа/ОбʼєктСловника.ll \
  .плавлення/МаМа/ОбʼєктСписку.ll \
  .плавлення/МаМа/ОбʼєктСтруктури.ll \
  .плавлення/МаМа/ОбʼєктТексту.ll \
  .плавлення/МаМа/ОбʼєктЮнікоду.ll \
  .плавлення/МаМа/ОбʼєктЧисла.ll \
  .плавлення/МаМа/Помилка.ll \
  .плавлення/МаМа/Середовище.ll \
  .плавлення/МаМа/СкладенийОбʼєкт.ll \
  .плавлення/МаМа/Утилізатор.ll \
  build-"$PLATFORM"/external/libmavka_external.a \
  build-"$PLATFORM"/external/mavka_parser/libmavka_parser.a \
  build-"$PLATFORM"/external/mavka_parser/syntax/libmavka_syntax.a \
  build-"$PLATFORM"/external/mavka_parser/syntax/antlr4-cpp-runtime/libantlr4_cpp_runtime.a