#!/usr/bin/env bash
set -e
set -x

TSIL="$1"

mkdir -p mavka-windows

$TSIL mavka-windows/.плавлення/мавка/бібліотека/М.ll скомпілювати мавка/бібліотека/М.ц
$TSIL mavka-windows/.плавлення/мавка/бібліотека/мавка.ll скомпілювати мавка/бібліотека/мавка.ц
$TSIL mavka-windows/.плавлення/мавка/бібліотека/МаМа.ll скомпілювати мавка/бібліотека/МаМа.ц
$TSIL mavka-windows/.плавлення/мавка/бібліотека/читати_юнікод.ll скомпілювати мавка/бібліотека/читати_юнікод.ц
$TSIL mavka-windows/.плавлення/мавка/компілятор/компілятор.ll скомпілювати мавка/компілятор/компілятор.ц
$TSIL mavka-windows/.плавлення/мавка/розбирач/розбирач.ll скомпілювати мавка/розбирач/розбирач.ц
$TSIL mavka-windows/.плавлення/мавка/математика.ll скомпілювати мавка/математика.ц
$TSIL mavka-windows/.плавлення/мавка/система.ll скомпілювати мавка/система.ц
$TSIL mavka-windows/.плавлення/мавка/допоміжне.ll скомпілювати мавка/допоміжне.ц
$TSIL mavka-windows/.плавлення/мавка/мавка.ll скомпілювати мавка/мавка.ц
$TSIL mavka-windows/.плавлення/МаМа/КД/КД.ll скомпілювати МаМа/КД/КД.ц
$TSIL mavka-windows/.плавлення/МаМа/біб.ll скомпілювати МаМа/біб.ц
$TSIL mavka-windows/.плавлення/МаМа/Код.ll скомпілювати МаМа/Код.ц
$TSIL mavka-windows/.плавлення/МаМа/Машина.ll скомпілювати МаМа/Машина.ц
$TSIL mavka-windows/.плавлення/МаМа/Назва.ll скомпілювати МаМа/Назва.ц
$TSIL mavka-windows/.плавлення/МаМа/Предмет.ll скомпілювати МаМа/Предмет.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметАдреси.ll скомпілювати МаМа/ПредметАдреси.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметБайтів.ll скомпілювати МаМа/ПредметБайтів.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметДії.ll скомпілювати МаМа/ПредметДії.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметЛогічного.ll скомпілювати МаМа/ПредметЛогічного.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметМодуля.ll скомпілювати МаМа/ПредметМодуля.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметНативноїДії.ll скомпілювати МаМа/ПредметНативноїДії.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметСловника.ll скомпілювати МаМа/ПредметСловника.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметСписку.ll скомпілювати МаМа/ПредметСписку.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметСтруктури.ll скомпілювати МаМа/ПредметСтруктури.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметТексту.ll скомпілювати МаМа/ПредметТексту.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметЮнікоду.ll скомпілювати МаМа/ПредметЮнікоду.ц
$TSIL mavka-windows/.плавлення/МаМа/ПредметЧисла.ll скомпілювати МаМа/ПредметЧисла.ц
$TSIL mavka-windows/.плавлення/МаМа/Помилка.ll скомпілювати МаМа/Помилка.ц
$TSIL mavka-windows/.плавлення/МаМа/Середовище.ll скомпілювати МаМа/Середовище.ц
$TSIL mavka-windows/.плавлення/МаМа/СкладенийПредмет.ll скомпілювати МаМа/СкладенийПредмет.ц
$TSIL mavka-windows/.плавлення/МаМа/Утилізатор.ll скомпілювати МаМа/Утилізатор.ц
$TSIL mavka-windows/.плавлення/старт.ll скомпілювати старт.ц

cp -a external/ mavka-windows/
cp -a ВЕРСІЯ mavka-windows/

echo -en "# Мавка для Windows

Тут знаходяться всі необхідні LLVM (.ll) та C++ файли для будування Мавки на Windows.

Ви можете власноруч збудувати Мавку на Windows використовуючи ці файли і компілятор Clang.

Завантажити останній автоматично збудований cross-компілятором Zig exe-файл Мавки можна з випусків (Releases).

Мавка наразі не сильно підтримується на Windows, тому якщо у вас щось не працює, повідомте про це.
" > mavka-windows/README.md