#!/bin/bash

MAVKA="$1"

run_test() {
  test_file="$1"
  echo "$test_file"
  $MAVKA "$test_file"
}

run_test тестування/Ціле/більше_цілого.м
run_test тестування/Ціле/віднімання_цілого.м
run_test тестування/Ціле/двійкове_або_цілого.м
run_test тестування/Ціле/двійкове_вабо_цілого.м
run_test тестування/Ціле/двійкове_і_цілого.м
run_test тестування/Ціле/двійкове_не_цілого.м
run_test тестування/Ціле/ділення_націло_цілого.м
run_test тестування/Ціле/ділення_цілого.м
run_test тестування/Ціле/додавання_цілого.м
run_test тестування/Ціле/змінити_знак_цілого.м
run_test тестування/Ціле/зсув_вліво_цілого.м
run_test тестування/Ціле/зсув_вправо_цілого.м
run_test тестування/Ціле/менше_цілого.м
run_test тестування/Ціле/множення_цілого.м
run_test тестування/Ціле/не_більше_цілого.м
run_test тестування/Ціле/не_менше_цілого.м
run_test тестування/Ціле/остача_цілого.м
run_test тестування/Ціле/степінь_цілого.м