#!/bin/bash

MAVKA="$1"

if [ -z "$MAVKA" ]; then
  echo "Usage: $0 <path_to_mavka_executable>"
  exit 1
fi

# Визначення кольорів
GREEN='\033[0;32m'
RED='\033[0;31m'
NC='\033[0m' # No Color

run_test() {
  test_file="$1"

  # Виводимо назву тесту без переносу рядка
  echo -n "$test_file: "

  # Запускаємо тест і захоплюємо як стандартний вивід (stdout), так і помилки (stderr)
  output=$($MAVKA "$test_file" 2>&1)
  status=$?

  if [ $status -eq 0 ]; then
    echo -e "${GREEN}УСПІХ${NC}"
  else
    echo -e "${RED}НЕВДАЧА${NC}"
    # Виводимо збережений текст помилки з невеликим відступом
    echo -e "-------------------------"
    echo "$output"
    echo -e "-------------------------\n"
  fi
}

run_test тестування/Число/більше_цілого.м
run_test тестування/Число/віднімання_цілого.м
run_test тестування/Число/двійкове_або_цілого.м
run_test тестування/Число/двійкове_вабо_цілого.м
run_test тестування/Число/двійкове_і_цілого.м
run_test тестування/Число/двійкове_не_цілого.м
run_test тестування/Число/ділення_цілого.м
run_test тестування/Число/додавання_цілого.м
run_test тестування/Число/змінити_знак_цілого.м
run_test тестування/Число/зсув_вліво_цілого.м
run_test тестування/Число/зсув_вправо_цілого.м
run_test тестування/Число/менше_цілого.м
run_test тестування/Число/множення_цілого.м
run_test тестування/Число/не_більше_цілого.м
run_test тестування/Число/не_менше_цілого.м
run_test тестування/Число/остача_цілого.м
run_test тестування/Число/степінь_цілого.м
run_test тестування/Число/більше_рухомого.м
run_test тестування/Число/віднімання_рухомого.м
run_test тестування/Число/ділення_рухомого.м
run_test тестування/Число/додавання_рухомого.м
run_test тестування/Число/змінити_знак_рухомого.м
run_test тестування/Число/менше_рухомого.м
run_test тестування/Число/множення_рухомого.м
run_test тестування/Число/не_більше_рухомого.м
run_test тестування/Число/не_менше_рухомого.м
run_test тестування/Число/остача_рухомого.м
run_test тестування/Число/степінь_рухомого.м

echo ""
run_test тестування/Дані/Дані.м
run_test тестування/Дані/виділити.м
run_test тестування/Дані/обнулено.м
run_test тестування/Дані/з_тексту.м
run_test тестування/Дані/з_послідовності.м
run_test тестування/Дані/зі_списку.м
run_test тестування/Дані/чародія_перебір.м

echo ""
run_test тестування/біб/система/записати_прочитати.м