#!/bin/bash

MAVKA="$1"

run_test() {
  test_file="$1"
  echo "$test_file"
  $MAVKA "$test_file"
}

echo "=== Ціле ==="
run_test тестування/Ціле/більше_цілого.м
run_test тестування/Ціле/віднімання_цілого.м
run_test тестування/Ціле/двійкове_або_цілого.м
run_test тестування/Ціле/двійкове_вабо_цілого.м
run_test тестування/Ціле/двійкове_і_цілого.м
run_test тестування/Ціле/двійкове_не_цілого.м
run_test тестування/Ціле/ділення_цілого.м
run_test тестування/Ціле/додавання_цілого.м
run_test тестування/Ціле/змінити_знак_цілого.м
run_test тестування/Ціле/зсув_вліво_цілого.м
run_test тестування/Ціле/зсув_вправо_цілого.м
run_test тестування/Ціле/менше_цілого.м
run_test тестування/Ціле/множення_цілого.м
run_test тестування/Ціле/не_більше_цілого.м
run_test тестування/Ціле/не_менше_цілого.м
run_test тестування/Ціле/остача_цілого.м
run_test тестування/Ціле/степінь_цілого.м

echo ""
echo "=== Дробове ==="
run_test тестування/Дробове/більше_дробового.м
run_test тестування/Дробове/віднімання_дробового.м
run_test тестування/Дробове/ділення_дробового.м
run_test тестування/Дробове/додавання_дробового.м
run_test тестування/Дробове/змінити_знак_дробового.м
run_test тестування/Дробове/менше_дробового.м
run_test тестування/Дробове/множення_дробового.м
run_test тестування/Дробове/не_більше_дробового.м
run_test тестування/Дробове/не_менше_дробового.м
run_test тестування/Дробове/остача_дробового.м
run_test тестування/Дробове/степінь_дробового.м