#ifndef BIBLIOTEKA_H
#define BIBLIOTEKA_H

#include "mavka/tsil.h"

р64 бібліотека_мавки_Е_р64();

р64 бібліотека_мавки_ЛОГ10_р64();

р64 бібліотека_мавки_ЛОГ2_р64();

р64 бібліотека_мавки_ЛОГ2Е_р64();

р64 бібліотека_мавки_ЛОГ10Е_р64();

р64 бібліотека_мавки_ПІ_р64();

р64 бібліотека_мавки_КОРІНЬ1_2_р64();

р64 бібліотека_мавки_КОРІНЬ2_р64();

р64 бібліотека_мавки_синус_р64(р64 значення);

р64 бібліотека_мавки_косинус_р64(р64 значення);

р64 бібліотека_мавки_тангенс_р64(р64 значення);

р64 бібліотека_мавки_арксинус_р64(р64 значення);

р64 бібліотека_мавки_арккосинус_р64(р64 значення);

р64 бібліотека_мавки_арктангенс_р64(р64 значення);

р64 бібліотека_мавки_арктангенс2_р64(р64 а, р64 б);

р64 бібліотека_мавки_абсолютне_р64(р64 значення);

р64 бібліотека_мавки_експонента_р64(р64 значення);

р64 бібліотека_мавки_корінь2_р64(р64 значення);

р64 бібліотека_мавки_стеля_р64(р64 значення);

р64 бібліотека_мавки_підлога_р64(р64 значення);

р64 бібліотека_мавки_округлити_р64(р64 значення);

р64 бібліотека_мавки_остача_від_ділення_р64(р64 а, р64 б);

р64 бібліотека_мавки_лог_р64(р64 значення);

р64 бібліотека_мавки_лог2_р64(р64 значення);

р64 бібліотека_мавки_лог10_р64(р64 значення);

void бібліотека_мавки_афс_видалити(п8* дані_шляху,
                                   природне розмір_шляху,
                                   void (*обробник)(природне видалено,
                                                    природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_дописати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_записати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_прочитати(п8* дані_шляху,
                                    природне розмір_шляху,
                                    void (*обробник)(п8* дані_даних,
                                                     природне розмір_даних,
                                                     природне помилка,
                                                     адреса аргумент),
                                    адреса аргумент);

void бібліотека_мавки_афс_створити_папку(п8* дані_шляху,
                                         природне розмір_шляху,
                                         void (*обробник)(природне помилка,
                                                          адреса аргумент),
                                         адреса аргумент);

// інет слуга
typedef void (*БібліотекаМавкиІнетСлугаОбробникПідключення)(
    адреса адр_клієнт_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникДаних)(адреса адр_клієнт_слуги,
                                                      п8* дані,
                                                      природне розмір);
typedef void (*БібліотекаМавкиІнетСлугаОбробникСтікання)(
    адреса адр_клієнт_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникПомилки)(природне помилка,
                                                        адреса аргумент_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникВідключення)(
    адреса адр_клієнт_слуги,
    природне помилка);
typedef void (*БібліотекаМавкиІнетСлугаОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетКлієнтСлугиОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетКлієнтСлугиОбробникНадіслання)(
    природне помилка,
    адреса аргумент);

адреса бібліотека_мавки_інет_служити(
    природне іа,
    природне порт,
    БібліотекаМавкиІнетСлугаОбробникПідключення обробник_підключення,
    БібліотекаМавкиІнетСлугаОбробникДаних обробник_даних,
    БібліотекаМавкиІнетСлугаОбробникСтікання обробник_стікання,
    БібліотекаМавкиІнетСлугаОбробникПомилки обробник_помилки,
    БібліотекаМавкиІнетСлугаОбробникВідключення обробник_відключення,
    адреса аргумент,
    БібліотекаМавкиІнетСлугаОбробникЗнищення обробник_знищення);

ціле бібліотека_мавки_інет_зупинити_слугу(адреса адр_слуга,
                                          природне закрити_підключення);

ціле бібліотека_мавки_інет_клієнт_слуги_надіслати(
    адреса адр_клієнт_слуги,
    п8* дані,
    природне розмір,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтСлугиОбробникНадіслання обробник);

адреса бібліотека_мавки_інет_отримати_аргумент_слуги_з_клієнта_слуги(
    адреса адр_клієнт_слуги);

void бібліотека_мавки_інет_записати_аргумент_клієнта_слуги(
    адреса адр_клієнт_слуги,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтСлугиОбробникЗнищення обробник_знищення);
адреса бібліотека_мавки_інет_отримати_аргумент_клієнта_слуги(
    адреса адр_клієнт_слуги);

// інет клієнт
typedef void (*БібліотекаМавкиІнетКлієнтОбробникПідключення)(адреса адр_клієнт);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникДаних)(адреса адр_клієнт,
                                                       п8* дані,
                                                       природне розмір);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникСтікання)(адреса адр_клієнт);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникПомилки)(
    природне помилка,
    адреса аргумент_клієнта);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникВідключення)(адреса адр_клієнт,
                                                             природне помилка);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникПомилкиКлієнт)(
    адреса адр_клієнт,
    природне помилка);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникЗакінчення)(адреса адр_клієнт);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникЗасидження)(адреса адр_клієнт);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетКлієнтОбробникНадіслання)(природне помилка,
                                                            адреса аргумент);

адреса бібліотека_інет_підключитись(
    природне іа,
    природне порт,
    БібліотекаМавкиІнетКлієнтОбробникПідключення обробник_підключення,
    БібліотекаМавкиІнетКлієнтОбробникДаних обробник_даних,
    БібліотекаМавкиІнетКлієнтОбробникСтікання обробник_стікання,
    БібліотекаМавкиІнетКлієнтОбробникПомилки обробник_помилки,
    БібліотекаМавкиІнетКлієнтОбробникВідключення обробник_відключення,
    БібліотекаМавкиІнетКлієнтОбробникПомилкиКлієнт обробник_помилки_підключення,
    БібліотекаМавкиІнетКлієнтОбробникЗакінчення обробник_закінчення,
    БібліотекаМавкиІнетКлієнтОбробникЗасидження обробник_засидження,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтОбробникЗнищення обробник_знищення);

ціле бібліотека_мавки_інет_клієнт_надіслати(
    адреса адр_клієнт,
    п8* дані,
    природне розмір,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтОбробникНадіслання обробник);

адреса бібліотека_мавки_інет_отримати_аргумент_клієнта(адреса адр_клієнт);

#endif // BIBLIOTEKA_H