#ifndef BIBLIOTEKA_H
#define BIBLIOTEKA_H

#include "mavka/tsil.h"

р64 бібліотека_мавки_Е_р64();

р64 бібліотека_мавки_ЛОГ10_р64();

р64 бібліотека_мавки_ЛОГ2_р64();

р64 бібліотека_мавки_ЛОГ2Е_р64();

р64 бібліотека_мавки_ЛОГ10Е_р64();

р64 бібліотека_мавки_ПІ_р64();

р64 бібліотека_мавки_КОРІНЬ1_2_р64();

р64 бібліотека_мавки_КОРІНЬ2_р64();

р64 бібліотека_мавки_синус_р64(р64 значення);

р64 бібліотека_мавки_косинус_р64(р64 значення);

р64 бібліотека_мавки_тангенс_р64(р64 значення);

р64 бібліотека_мавки_арксинус_р64(р64 значення);

р64 бібліотека_мавки_арккосинус_р64(р64 значення);

р64 бібліотека_мавки_арктангенс_р64(р64 значення);

р64 бібліотека_мавки_арктангенс2_р64(р64 а, р64 б);

р64 бібліотека_мавки_абсолютне_р64(р64 значення);

р64 бібліотека_мавки_експонента_р64(р64 значення);

р64 бібліотека_мавки_корінь2_р64(р64 значення);

р64 бібліотека_мавки_стеля_р64(р64 значення);

р64 бібліотека_мавки_підлога_р64(р64 значення);

р64 бібліотека_мавки_округлити_р64(р64 значення);

р64 бібліотека_мавки_остача_від_ділення_р64(р64 а, р64 б);

р64 бібліотека_мавки_лог_р64(р64 значення);

р64 бібліотека_мавки_лог2_р64(р64 значення);

р64 бібліотека_мавки_лог10_р64(р64 значення);

void бібліотека_мавки_афс_видалити(п8* дані_шляху,
                                   природне розмір_шляху,
                                   void (*обробник)(природне видалено,
                                                    природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_дописати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_записати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_прочитати(п8* дані_шляху,
                                    природне розмір_шляху,
                                    void (*обробник)(п8* дані_даних,
                                                     природне розмір_даних,
                                                     природне помилка,
                                                     адреса аргумент),
                                    адреса аргумент);

void бібліотека_мавки_афс_створити_папку(п8* дані_шляху,
                                         природне розмір_шляху,
                                         void (*обробник)(природне помилка,
                                                          адреса аргумент),
                                         адреса аргумент);

// інет слуга
typedef void (*БібліотекаМавкиІнетСлугаОбробникПідключення)(
    адреса адр_клієнт_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникДаних)(адреса адр_клієнт_слуги,
                                                      п8* дані,
                                                      природне розмір);
typedef void (*БібліотекаМавкиІнетСлугаОбробникСтікання)(
    адреса адр_клієнт_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникПомилки)(природне помилка,
                                                        адреса аргумент_слуги);
typedef void (*БібліотекаМавкиІнетСлугаОбробникВідключення)(
    адреса адр_клієнт_слуги,
    природне помилка);
typedef void (*БібліотекаМавкиІнетСлугаОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетКлієнтСлугиОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетКлієнтСлугиОбробникНадіслання)(
    природне помилка,
    адреса аргумент);

адреса бібліотека_мавки_інет_служити(
    природне іа,
    природне порт,
    БібліотекаМавкиІнетСлугаОбробникПідключення обробник_підключення,
    БібліотекаМавкиІнетСлугаОбробникДаних обробник_даних,
    БібліотекаМавкиІнетСлугаОбробникСтікання обробник_стікання,
    БібліотекаМавкиІнетСлугаОбробникПомилки обробник_помилки,
    БібліотекаМавкиІнетСлугаОбробникВідключення обробник_відключення,
    адреса аргумент,
    БібліотекаМавкиІнетСлугаОбробникЗнищення обробник_знищення);

ціле бібліотека_мавки_інет_зупинити_слугу(адреса адр_слуги,
                                          природне закрити_підключення);

ціле бібліотека_мавки_інет_клієнт_слуги_надіслати(
    адреса адр_клієнта_слуги,
    п8* дані,
    природне розмір,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтСлугиОбробникНадіслання обробник);

адреса бібліотека_мавки_інет_отримати_аргумент_слуги_з_клієнта(
    адреса адр_клієнт_слуги);

void бібліотека_мавки_інет_записати_аргумент_клієнта_слуги(
    адреса адр_клієнт_слуги,
    адреса аргумент,
    БібліотекаМавкиІнетКлієнтСлугиОбробникЗнищення обробник_знищення);
адреса бібліотека_мавки_інет_отримати_аргумент_клієнта_слуги(
    адреса адр_клієнт_слуги);

// інет підключення
typedef void (*БібліотекаМавкиІнетПідключенняОбробникПідключення)(
    адреса адр_підключення);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникДаних)(
    адреса адр_підключення,
    п8* дані,
    природне розмір);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникСтікання)(
    адреса адр_підключення);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникПомилки)(
    природне помилка,
    адреса аргумент_підключення);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникВідключення)(
    адреса адр_підключення,
    природне помилка);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникПомилкиПідключення)(
    адреса адр_підключення,
    природне помилка);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникЗакінчення)(
    адреса адр_підключення);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникЗасидження)(
    адреса адр_підключення);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникЗнищення)(адреса аргумент);
typedef void (*БібліотекаМавкиІнетПідключенняОбробникНадіслання)(
    природне помилка,
    адреса аргумент);

адреса бібліотека_інет_підключитись(
    природне іа,
    природне порт,
    БібліотекаМавкиІнетПідключенняОбробникПідключення обробник_підключення,
    БібліотекаМавкиІнетПідключенняОбробникДаних обробник_даних,
    БібліотекаМавкиІнетПідключенняОбробникСтікання обробник_стікання,
    БібліотекаМавкиІнетПідключенняОбробникПомилки обробник_помилки,
    БібліотекаМавкиІнетПідключенняОбробникВідключення обробник_відключення,
    БібліотекаМавкиІнетПідключенняОбробникПомилкиПідключення
        обробник_помилки_підключення,
    БібліотекаМавкиІнетПідключенняОбробникЗакінчення обробник_закінчення,
    БібліотекаМавкиІнетПідключенняОбробникЗасидження обробник_засидження,
    адреса аргумент,
    БібліотекаМавкиІнетПідключенняОбробникЗнищення обробник_знищення);

ціле бібліотека_мавки_інет_підключення_надіслати(
    адреса адр_підключення,
    п8* дані,
    природне розмір,
    адреса аргумент,
    БібліотекаМавкиІнетПідключенняОбробникНадіслання обробник);

адреса бібліотека_мавки_інет_отримати_аргумент_підключення(
    адреса адр_підключення);

#endif // BIBLIOTEKA_H