#ifndef BIBLIOTEKA_H
#define BIBLIOTEKA_H

#include "mavka/tsil.h"

extern д64 бібліотека_мавки_синус_д64(д64 значення);

extern д64 бібліотека_мавки_косинус_д64(д64 значення);

extern д64 бібліотека_мавки_тангенс_д64(д64 значення);

extern д64 бібліотека_мавки_арксинус_д64(д64 значення);

extern д64 бібліотека_мавки_арккосинус_д64(д64 значення);

extern д64 бібліотека_мавки_арктангенс_д64(д64 значення);

extern д64 бібліотека_мавки_арктангенс2_д64(д64 а, д64 б);

extern д64 бібліотека_мавки_абсолютне_д64(д64 значення);

extern д64 бібліотека_мавки_експонента_д64(д64 значення);

extern д64 бібліотека_мавки_корінь_д64(д64 значення);

extern д64 бібліотека_мавки_стеля_д64(д64 значення);

extern д64 бібліотека_мавки_підлога_д64(д64 значення);

extern д64 бібліотека_мавки_округлити_д64(д64 значення);

extern д64 бібліотека_мавки_остача_від_ділення_д64(д64 а, д64 б);

#endif // BIBLIOTEKA_H