#ifndef BIBLIOTEKA_H
#define BIBLIOTEKA_H

#include "mavka/tsil.h"

р64 бібліотека_мавки_Е_р64();

р64 бібліотека_мавки_ЛОГ10_р64();

р64 бібліотека_мавки_ЛОГ2_р64();

р64 бібліотека_мавки_ЛОГ2Е_р64();

р64 бібліотека_мавки_ЛОГ10Е_р64();

р64 бібліотека_мавки_ПІ_р64();

р64 бібліотека_мавки_КОРІНЬ1_2_р64();

р64 бібліотека_мавки_КОРІНЬ2_р64();

р64 бібліотека_мавки_синус_р64(р64 значення);

р64 бібліотека_мавки_косинус_р64(р64 значення);

р64 бібліотека_мавки_тангенс_р64(р64 значення);

р64 бібліотека_мавки_арксинус_р64(р64 значення);

р64 бібліотека_мавки_арккосинус_р64(р64 значення);

р64 бібліотека_мавки_арктангенс_р64(р64 значення);

р64 бібліотека_мавки_арктангенс2_р64(р64 а, р64 б);

р64 бібліотека_мавки_абсолютне_р64(р64 значення);

р64 бібліотека_мавки_експонента_р64(р64 значення);

р64 бібліотека_мавки_корінь2_р64(р64 значення);

р64 бібліотека_мавки_стеля_р64(р64 значення);

р64 бібліотека_мавки_підлога_р64(р64 значення);

р64 бібліотека_мавки_округлити_р64(р64 значення);

р64 бібліотека_мавки_остача_від_ділення_р64(р64 а, р64 б);

р64 бібліотека_мавки_лог_р64(р64 значення);

р64 бібліотека_мавки_лог2_р64(р64 значення);

р64 бібліотека_мавки_лог10_р64(р64 значення);

void бібліотека_мавки_афс_видалити(п8* дані_шляху,
                                   природне розмір_шляху,
                                   void (*обробник)(природне видалено,
                                                    природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_дописати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_записати(п8* дані_шляху,
                                   природне розмір_шляху,
                                   п8* дані_даних,
                                   природне розмір_даних,
                                   void (*обробник)(природне помилка,
                                                    адреса аргумент),
                                   адреса аргумент);

void бібліотека_мавки_афс_прочитати(п8* дані_шляху,
                                    природне розмір_шляху,
                                    void (*обробник)(п8* дані_даних,
                                                     природне розмір_даних,
                                                     природне помилка,
                                                     адреса аргумент),
                                    адреса аргумент);

void бібліотека_мавки_афс_створити_папку(п8* дані_шляху,
                                         природне розмір_шляху,
                                         void (*обробник)(природне помилка,
                                                          адреса аргумент),
                                         адреса аргумент);

typedef void (*ІнтернетСлугаОбробникДаних)(адреса розетка,
                                           п8* дані,
                                           природне розмір);
typedef void (*ІнтернетСлугаОбробникПідключення)(адреса розетка);
typedef void (*ІнтернетСлугаОбробникВідключення)(адреса розетка,
                                                 природне помилка);
typedef void (*ІнтернетСлугаОбробникСтікання)(адреса розетка);
typedef void (*ІнтернетСлугаОбробникПомилки)(природне помилка,
                                             адреса аргумент_слуги);
typedef void (*ІнтернетСлугаОбробникПомилкиПідключення)(адреса розетка,
                                                        природне помилка);
typedef void (*ІнтернетСлугаОбробникЗакінчення)(адреса розетка);
typedef void (*ІнтернетСлугаОбробникЗасидження)(адреса розетка);
typedef void (*ІнтернетСлугаРозеткаОбробникЗнищення)(адреса аргумент);
typedef void (*ІнтернетСлугаОбробникЗнищення)(адреса аргумент);
typedef void (*ІнтернетОбробникНадіслання)(природне помилка, адреса аргумент);

адреса бібліотека_інтернет_служити(
    природне іа,
    природне порт,
    ІнтернетСлугаОбробникДаних обробник_даних,
    ІнтернетСлугаОбробникПідключення обробник_підключення,
    ІнтернетСлугаОбробникВідключення обробник_відключення,
    ІнтернетСлугаОбробникСтікання обробник_стікання,
    ІнтернетСлугаОбробникПомилки обробник_помилки,
    адреса аргумент,
    ІнтернетСлугаОбробникЗнищення обробник_знищення);

ціле бібліотека_мавки_інет_надіслати_клієнту_слуги(
    адреса розетка,
    п8* дані,
    природне розмір,
    адреса аргумент,
    ІнтернетОбробникНадіслання обробник);

ціле бібліотека_мавки_інет_зупинити_слуги(адреса слуга,
                                          природне закрити_підключення);

адреса бібліотека_інтернет_підключитись(
    природне порт,
    ІнтернетСлугаОбробникДаних обробник_даних,
    ІнтернетСлугаОбробникПідключення обробник_підключення,
    ІнтернетСлугаОбробникВідключення обробник_відключення,
    ІнтернетСлугаОбробникСтікання обробник_стікання,
    ІнтернетСлугаОбробникПомилки обробник_помилки,
    ІнтернетСлугаОбробникПомилкиПідключення обробник_помилки_підключення,
    ІнтернетСлугаОбробникЗакінчення обробник_закінчення,
    ІнтернетСлугаОбробникЗасидження обробник_засидження);

адреса бібліотека_мавки_інет_отримати_аргумент_слуги_з_клієнта(адреса розетка);

void бібліотека_мавки_інет_записати_аргумент_клієнта_слуги(
    адреса розетка,
    адреса аргумент,
    ІнтернетСлугаРозеткаОбробникЗнищення обробник_знищення);
адреса бібліотека_мавки_інет_отримати_аргумент_клієнта_слуги(адреса розетка);

#endif // BIBLIOTEKA_H