#pragma once

#ifndef MAVKA_AST_H
#define MAVKA_AST_H

#define АСДВидНіщо 0
#define АСДВидВизначитиСубʼєкт 1
#define АСДВидЗвернутисьДоСубʼєкта 2
#define АСДВидОтриматиВластивість 3
#define АСДВидЗмінитиВластивість 4
#define АСДВидОтриматиЕлемент 20
#define АСДВидПокластиЕлемент 21
#define АСДВидСтворитиПусто 17
#define АСДВидСтворитиТак 18
#define АСДВидСтворитиНі 19
#define АСДВидСтворитиЧисло 5
#define АСДВидСтворитиТекст 6
#define АСДВидСтворитиСимвол 30
#define АСДВидСтворитиСтруктуру 7
#define АСДВидСтворитиДію 8
#define АСДВидВернути 9
#define АСДВидСтворитиДіюДляСтруктури 10
#define АСДВидСтворитиМодуль 11
#define АСДВидДати 29
#define АСДВидСтворитиСписок 12
#define АСДВидСтворитиСловник 13
#define АСДВидВиконатиДію 14
#define АСДВидОперація 15
#define АСДВидСамоОперація 16
#define АСДВидСтворитиБога 22
#define АСДВидСтворитиШаблонСтруктури 23
#define АСДВидСтворитиШаблонДії 24
#define АСДВидВиконатиШаблон 25
#define АСДВидЗначенняЯкщо 26
#define АСДВидЧекати 27
#define АСДВидЯк 28

#define АСДВидЯкщо 50
#define АСДВидПоки 51
#define АСДВидВзяти 52
#define АСДВидСпробувати 53
#define АСДВидВпасти 54
#define АСДВидПеребрати 55
#define АСДВидПеребратиДіапазон 56
#define АСДВидПропустити 57
#define АСДВидПерервати 58

#define АСДВидІдентифікатор 100
#define АСДВидПараметрСтруктури 101
#define АСДВидПараметрДії 102
#define АСДВидАргументВиконанняДіїЗНазвою 103
#define АСДВидЕлементСловника 104
#define АСДВидЕлементДати 105
#define АСДВидТип 106
#define АСДВидЕлементВзяти 107

#define ОпераціяДодати 0
#define ОпераціяВідняти 1
#define ОпераціяПомножити 2
#define ОпераціяПоділити 3
#define ОпераціяПоділитиЗаМодулем 4
#define ОпераціяПоділитиНаціло 5
#define ОпераціяПіднестиДоСтепеня 6
#define ОпераціяДвійковеІ 7
#define ОпераціяДвійковеАбо 8
#define ОпераціяДвійковеВиключнеАбо 9
#define ОпераціяДвійковийЗсувВліво 10
#define ОпераціяДвійковийЗсувВправо 11
#define ОпераціяДвійковийЗсувВправоЗЗаповненням 24
#define ОпераціяПорівнятиЧиРівно 12
#define ОпераціяПорівнятиЧиНеРівно 13
#define ОпераціяПорівнятиЧиБільше 14
#define ОпераціяПорівнятиЧиМенше 15
#define ОпераціяПорівнятиЧиНеБільше 16
#define ОпераціяПорівнятиЧиНеМенше 17
#define ОпераціяПорівнятиЧиЄ 18
#define ОпераціяПорівнятиЧиНеЄ 19
#define ОпераціяПорівнятиЧиМістить 20
#define ОпераціяПорівнятиЧиНеМістить 21
#define ОпераціяПеревіритиЧиОбоєТак 22
#define ОпераціяПеревіритиЧиЯкийсьТак 23

#define СамоОпераціяЗробитиВідʼємним 1
#define СамоОпераціяДвійковеНі 2
#define СамоОпераціяЗаперечити 3

#include <iostream>

extern "C" {
struct Місцезнаходження;
struct АСДЗначення;
struct СписокАСДЗначень;

struct ВизначитиСубʼєктАСДДані;
struct ЗвернутисьДоСубʼєктаАСДДані;
struct ОтриматиВластивістьАСДДані;
struct ЗмінитиВластивістьАСДДані;
struct ОтриматиЕлементАСДДані;
struct ПокластиЕлементАСДДані;
struct СтворитиПустоАСДДані;
struct СтворитиТакАСДДані;
struct СтворитиНіАСДДані;
struct СтворитиЧислоАСДДані;
struct СтворитиТекстАСДДані;
struct СтворитиСимволАСДДані;
struct СтворитиСтруктуруАСДДані;
struct СтворитиДіюАСДДані;
struct ВернутиАСДДані;
struct СтворитиДіюДляСтруктуриАСДДані;
struct СтворитиМодульАСДДані;
struct ДатиАСДДані;
struct СтворитиСписокАСДДані;
struct СтворитиСловникАСДДані;
struct ВиконатиДіюАСДДані;
struct ОпераціяАСДДані;
struct СамоОпераціяАСДДані;
struct СтворитиБогаАСДДані;
struct СтворитиШаблонСтруктуриАСДДані;
struct СтворитиШаблонДіїАСДДані;
struct ВиконатиШаблонАСДДані;
struct ЗначенняЯкщоАСДДані;
struct ЧекатиАСДДані;
struct ЯкАСДДані;

struct ЯкщоАСДДані;
struct ПокиАСДДані;
struct ВзятиАСДДані;
struct СпробуватиАСДДані;
struct ВпастиАСДДані;
struct ПеребратиАСДДані;
struct ПеребратиДіапазонАСДДані;
struct ПропуститиАСДДані;
struct ПерерватиАСДДані;

struct ІдентифікаторАСДДані;
struct ПараметрСтруктуриАСДДані;
struct ПараметрДіїАСДДані;
struct АргументВиконанняДіїЗНазвоюАСДДані;
struct ЕлементСловникаАСДДані;
struct ЕлементДатиАСДДані;
struct ТипАСДДані;
struct ЕлементВзятиАСДДані;

struct ТекстКоду;
struct ПомилкаРозборуМавки;
struct РезультатРозборуМавки;

struct Місцезнаходження {
  ТекстКоду* текст_коду;
  size_t рядок;
  size_t стовпець;
};

struct АСДЗначення {
  size_t вид = АСДВидНіщо;
  void* дані = nullptr;
  Місцезнаходження* місцезнаходження = nullptr;
};

struct СписокАСДЗначень {
  size_t розмір;
  АСДЗначення** елементи;
};

struct ВизначитиСубʼєктАСДДані {
  АСДЗначення* ідентифікатор;
  АСДЗначення* значення;
};

struct ЗвернутисьДоСубʼєктаАСДДані {
  АСДЗначення* ідентифікатор;
};

struct ОтриматиВластивістьАСДДані {
  АСДЗначення* субʼєкт;
  АСДЗначення* ідентифікатор;
};

struct ЗмінитиВластивістьАСДДані {
  АСДЗначення* субʼєкт;
  АСДЗначення* ідентифікатор;
  АСДЗначення* значення;
};

struct ОтриматиЕлементАСДДані {
  АСДЗначення* субʼєкт;
  АСДЗначення* ключ;
};

struct ПокластиЕлементАСДДані {
  АСДЗначення* субʼєкт;
  АСДЗначення* ключ;
  АСДЗначення* значення;
};

struct СтворитиПустоАСДДані {
  size_t щось;
};

struct СтворитиТакАСДДані {
  size_t щось;
};

struct СтворитиНіАСДДані {
  size_t щось;
};

struct СтворитиЧислоАСДДані {
  char* значення;
};

struct СтворитиТекстАСДДані {
  char* значення;
  bool інтерпольовано;
};

struct СтворитиСимволАСДДані {
  char* значення;
};

struct СтворитиСтруктуруАСДДані {
  АСДЗначення* ідентифікатор;
  АСДЗначення* предок;
  СписокАСДЗначень елементи;
};

struct СтворитиДіюАСДДані {
  size_t чи_тривала;
  АСДЗначення* ідентифікатор;
  СписокАСДЗначень параметри;
  АСДЗначення* тип_повернення;
  СписокАСДЗначень тіло;
};

struct ВернутиАСДДані {
  АСДЗначення* значення;
};

struct СтворитиДіюДляСтруктуриАСДДані {
  АСДЗначення* для_структури;
  АСДЗначення* значення_дії;
};

struct СтворитиМодульАСДДані {
  АСДЗначення* ідентифікатор;
  СписокАСДЗначень тіло;
};

struct ДатиАСДДані {
  СписокАСДЗначень елементи;
};

struct СтворитиСписокАСДДані {
  СписокАСДЗначень елементи;
};

struct СтворитиСловникАСДДані {
  СписокАСДЗначень елементи;
};

struct ВиконатиДіюАСДДані {
  АСДЗначення* субʼєкт;
  СписокАСДЗначень аргументи;
};

struct ОпераціяАСДДані {
  АСДЗначення* ліво;
  size_t операція;
  АСДЗначення* право;
};

struct СамоОпераціяАСДДані {
  size_t операція;
  АСДЗначення* значення;
};

struct СтворитиБогаАСДДані {
  СписокАСДЗначень елементи;
};

struct СтворитиШаблонСтруктуриАСДДані {
  СписокАСДЗначень параметри;
  АСДЗначення* значення_структури;
};

struct СтворитиШаблонДіїАСДДані {
  СписокАСДЗначень параметри;
  АСДЗначення* значення_дії;
};

struct ВиконатиШаблонАСДДані {
  АСДЗначення* субʼєкт;
  СписокАСДЗначень аргументи;
};

struct ЗначенняЯкщоАСДДані {
  АСДЗначення* умова;
  АСДЗначення* якщо_так;
  АСДЗначення* якщо_ні;
};

struct ЧекатиАСДДані {
  АСДЗначення* значення;
};

struct ЯкАСДДані {
  АСДЗначення* ліво;
  АСДЗначення* право;
};

struct ЯкщоАСДДані {
  АСДЗначення* умова;
  СписокАСДЗначень тіло;
  СписокАСДЗначень тіло_інакше;
};

struct ПокиАСДДані {
  АСДЗначення* умова;
  СписокАСДЗначень тіло;
};

struct ВзятиАСДДані {
  АСДЗначення* ідентифікатор_репозиторія;
  СписокАСДЗначень шлях;
  АСДЗначення* ідентифікатор_назви;
  СписокАСДЗначень елементи;
};

struct ЕлементВзятиАСДДані {
  АСДЗначення* ідентифікатор_властивості;
  АСДЗначення* ідентифікатор_назви;
};

struct СпробуватиАСДДані {
  СписокАСДЗначень тіло;
  АСДЗначення* ідентифікатор_зловити;
  СписокАСДЗначень тіло_зловити;
};

struct ВпастиАСДДані {
  АСДЗначення* значення;
};

struct ПеребратиАСДДані {
  АСДЗначення* значення;
  АСДЗначення* ідентифікатор;
  СписокАСДЗначень тіло;
};

struct ПеребратиДіапазонАСДДані {
  АСДЗначення* від;
  АСДЗначення* до;
  АСДЗначення* ідентифікатор;
  СписокАСДЗначень тіло;
};

struct ПропуститиАСДДані {
  size_t щось;
};

struct ПерерватиАСДДані {
  size_t щось;
};

struct ІдентифікаторАСДДані {
  char* назва;
};

struct ПараметрСтруктуриАСДДані {
  АСДЗначення* ідентифікатор;
  АСДЗначення* тип;
  АСДЗначення* значення;
};

struct ПараметрДіїАСДДані {
  АСДЗначення* ідентифікатор;
  АСДЗначення* тип;
  АСДЗначення* значення;
};

struct АргументВиконанняДіїЗНазвоюАСДДані {
  АСДЗначення* ідентифікатор;
  АСДЗначення* значення;
};

struct ЕлементСловникаАСДДані {
  АСДЗначення* ключ;
  АСДЗначення* значення;
};

struct ЕлементДатиАСДДані {
  АСДЗначення* субʼєкт;
  АСДЗначення* ідентифікатор;
};

struct ТипАСДДані {
  size_t може_бути_пусто;
  АСДЗначення* значення;
};

struct ТекстКоду {
  char* шлях;
  char* значення;
};

struct ПомилкаРозборуМавки {
  Місцезнаходження* місцезнаходження;
  char* повідомлення;
};

struct РезультатРозборуМавки {
  size_t успіх;
  СписокАСДЗначень тіло;
  ПомилкаРозборуМавки помилка;
};

struct РезультатРозборуТекстуМавки {
  size_t успіх;
  АСДЗначення* значення;
  ПомилкаРозборуМавки помилка;
};

РезультатРозборуМавки розібрати_мавку(ТекстКоду* текст_коду);
РезультатРозборуТекстуМавки розібрати_текст_мавки(ТекстКоду* текст_коду,
                                                  char* value,
                                                  size_t startLine,
                                                  size_t startColumn);
}

#endif // MAVKA_AST_H