#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include "mavka/biblioteka.h"
#include "mavka/prystriy.h"

extern р64 бібліотека_мавки_синус_р64(р64 значення) {
  return sin(значення);
}

extern р64 бібліотека_мавки_косинус_р64(р64 значення) {
  return cos(значення);
}

extern р64 бібліотека_мавки_тангенс_р64(р64 значення) {
  return tan(значення);
}

extern р64 бібліотека_мавки_арксинус_р64(р64 значення) {
  return asin(значення);
}

extern р64 бібліотека_мавки_арккосинус_р64(р64 значення) {
  return acos(значення);
}

extern р64 бібліотека_мавки_арктангенс_р64(р64 значення) {
  return atan(значення);
}

extern р64 бібліотека_мавки_арктангенс2_р64(р64 а, р64 б) {
  return atan2(а, б);
}

extern р64 бібліотека_мавки_абсолютне_р64(р64 значення) {
  return fabs(значення);
}

extern р64 бібліотека_мавки_експонента_р64(р64 значення) {
  return exp(значення);
}

extern р64 бібліотека_мавки_корінь_р64(р64 значення) {
  return sqrt(значення);
}

extern р64 бібліотека_мавки_стеля_р64(р64 значення) {
  return ceil(значення);
}

extern р64 бібліотека_мавки_підлога_р64(р64 значення) {
  return floor(значення);
}

extern р64 бібліотека_мавки_округлити_р64(р64 значення) {
  return round(значення);
}

extern р64 бібліотека_мавки_остача_від_ділення_р64(р64 а, р64 б) {
  return fmod(а, б);
}
