#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include "mavka/biblioteka.h"
#include "mavka/prystriy.h"

д64 бібліотека_мавки_синус_д64(д64 значення) {
  return sin(значення);
}

д64 бібліотека_мавки_косинус_д64(д64 значення) {
  return cos(значення);
}

д64 бібліотека_мавки_тангенс_д64(д64 значення) {
  return tan(значення);
}

д64 бібліотека_мавки_арксинус_д64(д64 значення) {
  return asin(значення);
}

д64 бібліотека_мавки_арккосинус_д64(д64 значення) {
  return acos(значення);
}

д64 бібліотека_мавки_арктангенс_д64(д64 значення) {
  return atan(значення);
}

д64 бібліотека_мавки_арктангенс2_д64(д64 а, д64 б) {
  return atan2(а, б);
}

д64 бібліотека_мавки_абсолютне_д64(д64 значення) {
  return fabs(значення);
}

д64 бібліотека_мавки_експонента_д64(д64 значення) {
  return exp(значення);
}

д64 бібліотека_мавки_корінь_д64(д64 значення) {
  return sqrt(значення);
}

д64 бібліотека_мавки_стеля_д64(д64 значення) {
  return ceil(значення);
}

д64 бібліотека_мавки_підлога_д64(д64 значення) {
  return floor(значення);
}

д64 бібліотека_мавки_округлити_д64(д64 значення) {
  return round(значення);
}

д64 бібліотека_мавки_остача_від_ділення_д64(д64 а, д64 б) {
  return fmod(а, б);
}
